[NoCoverage] BlockStatement
packages/platform-config/src/local-env.ts:11:42
 const DEFAULT_STAGE: DeploymentStage = "dev";
 type EnvironmentMap = Record<string, string | undefined>;
 
-function getDefaultEnv(): EnvironmentMap {
-  return (
-    (globalThis as { process?: { env?: EnvironmentMap } }).process?.env ?? {}
-  );
-}
+function getDefaultEnv(): EnvironmentMap {}
 
 function readNumber(value: string | undefined, fallback: number): number {

[NoCoverage] LogicalOperator
packages/platform-config/src/local-env.ts:13:5
 
 function getDefaultEnv(): EnvironmentMap {
   return (
-    (globalThis as { process?: { env?: EnvironmentMap } }).process?.env ?? {}
+    (globalThis as {
+  process?: {
+    env?: EnvironmentMap;
+  };
+}).process?.env && {}
   );
 }

[NoCoverage] OptionalChaining
packages/platform-config/src/local-env.ts:13:5
 
 function getDefaultEnv(): EnvironmentMap {
   return (
-    (globalThis as { process?: { env?: EnvironmentMap } }).process?.env ?? {}
+    (globalThis as {
+  process?: {
+    env?: EnvironmentMap;
+  };
+}).process.env ?? {}
   );
 }

[Killed] BlockStatement
packages/platform-config/src/local-env.ts:17:74
   );
 }
 
-function readNumber(value: string | undefined, fallback: number): number {
-  if (value === undefined || value.length === 0) {
-    return fallback;
-  }
-
-  const parsed = Number(value);
-
-  if (!Number.isFinite(parsed)) {
-    throw new Error(`Expected numeric environment value, received: ${value}`);
-  }
-
-  return parsed;
-}
+function readNumber(value: string | undefined, fallback: number): number {}
 
 function readBoolean(value: string | undefined, fallback: boolean): boolean {
killedBy: getLocalPlatformConfig respects explicit environment overrides
statusReason: expected undefined to be 30 // Object.is equality

[Killed] LogicalOperator
packages/platform-config/src/local-env.ts:18:7
 }
 
 function readNumber(value: string | undefined, fallback: number): number {
-  if (value === undefined || value.length === 0) {
+  if (value === undefined && value.length === 0) {
     return fallback;
   }
killedBy: getLocalPlatformConfig returns the local development defaults
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
packages/platform-config/src/local-env.ts:18:7
 }
 
 function readNumber(value: string | undefined, fallback: number): number {
-  if (value === undefined || value.length === 0) {
+  if (false) {
     return fallback;
   }
killedBy: getLocalPlatformConfig returns the local development defaults
statusReason: Expected numeric environment value, received: undefined

[Killed] BooleanLiteral
packages/platform-config/src/local-env.ts:24:7
 
   const parsed = Number(value);
 
-  if (!Number.isFinite(parsed)) {
+  if (Number.isFinite(parsed)) {
     throw new Error(`Expected numeric environment value, received: ${value}`);
   }
killedBy: getLocalPlatformConfig respects explicit environment overrides
statusReason: Expected numeric environment value, received: 30

[Killed] ConditionalExpression
packages/platform-config/src/local-env.ts:24:7
 
   const parsed = Number(value);
 
-  if (!Number.isFinite(parsed)) {
+  if (true) {
     throw new Error(`Expected numeric environment value, received: ${value}`);
   }
killedBy: getLocalPlatformConfig respects explicit environment overrides
statusReason: Expected numeric environment value, received: 30

[Killed] BlockStatement
packages/platform-config/src/local-env.ts:31:77
   return parsed;
 }
 
-function readBoolean(value: string | undefined, fallback: boolean): boolean {
-  if (value === undefined || value.length === 0) {
-    return fallback;
-  }
-
-  return value.toLowerCase() === "true";
-}
+function readBoolean(value: string | undefined, fallback: boolean): boolean {}
 
 function readStage(value: string | undefined): DeploymentStage {
killedBy: getLocalPlatformConfig respects explicit environment overrides
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
packages/platform-config/src/local-env.ts:32:50
 }
 
 function readBoolean(value: string | undefined, fallback: boolean): boolean {
-  if (value === undefined || value.length === 0) {
-    return fallback;
-  }
+  if (value === undefined || value.length === 0) {}
 
   return value.toLowerCase() === "true";
killedBy: getLocalPlatformConfig returns the local development defaults
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] EqualityOperator
packages/platform-config/src/local-env.ts:32:7
 }
 
 function readBoolean(value: string | undefined, fallback: boolean): boolean {
-  if (value === undefined || value.length === 0) {
+  if (value !== undefined || value.length === 0) {
     return fallback;
   }
killedBy: getLocalPlatformConfig returns the local development defaults
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
packages/platform-config/src/local-env.ts:36:10
     return fallback;
   }
 
-  return value.toLowerCase() === "true";
+  return value.toLowerCase() !== "true";
 }
 
killedBy: getLocalPlatformConfig respects explicit environment overrides
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/platform-config/src/local-env.ts:36:10
     return fallback;
   }
 
-  return value.toLowerCase() === "true";
+  return true;
 }
 
killedBy: getLocalPlatformConfig respects explicit environment overrides
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
packages/platform-config/src/local-env.ts:39:64
   return value.toLowerCase() === "true";
 }
 
-function readStage(value: string | undefined): DeploymentStage {
-  if (value === undefined || value.length === 0) {
-    return DEFAULT_STAGE;
-  }
-
-  if (value === "dev" || value === "staging" || value === "prod") {
-    return value;
-  }
-
-  throw new Error(`Unsupported CASEMIND_STAGE: ${value}`);
-}
+function readStage(value: string | undefined): DeploymentStage {}
 
 function readRequired(
killedBy: getLocalPlatformConfig returns the local development defaults
statusReason: expected undefined to be 'dev' // Object.is equality

[Killed] EqualityOperator
packages/platform-config/src/local-env.ts:40:30
 }
 
 function readStage(value: string | undefined): DeploymentStage {
-  if (value === undefined || value.length === 0) {
+  if (value === undefined || value.length !== 0) {
     return DEFAULT_STAGE;
   }
killedBy: getLocalPlatformConfig respects explicit environment overrides
statusReason: expected 'dev' to be 'staging' // Object.is equality

[Killed] BlockStatement
packages/platform-config/src/local-env.ts:40:50
 }
 
 function readStage(value: string | undefined): DeploymentStage {
-  if (value === undefined || value.length === 0) {
-    return DEFAULT_STAGE;
-  }
+  if (value === undefined || value.length === 0) {}
 
   if (value === "dev" || value === "staging" || value === "prod") {
killedBy: getLocalPlatformConfig returns the local development defaults
statusReason: Unsupported CASEMIND_STAGE: undefined

[Killed] BlockStatement
packages/platform-config/src/local-env.ts:44:67
     return DEFAULT_STAGE;
   }
 
-  if (value === "dev" || value === "staging" || value === "prod") {
-    return value;
-  }
+  if (value === "dev" || value === "staging" || value === "prod") {}
 
   throw new Error(`Unsupported CASEMIND_STAGE: ${value}`);
killedBy: getLocalPlatformConfig respects explicit environment overrides
statusReason: Unsupported CASEMIND_STAGE: staging

[Killed] ConditionalExpression
packages/platform-config/src/local-env.ts:44:26
     return DEFAULT_STAGE;
   }
 
-  if (value === "dev" || value === "staging" || value === "prod") {
+  if (value === "dev" || false || value === "prod") {
     return value;
   }
killedBy: getLocalPlatformConfig respects explicit environment overrides
statusReason: Unsupported CASEMIND_STAGE: staging

[Killed] BlockStatement
packages/platform-config/src/local-env.ts:55:11
   value: string | undefined,
   name: string,
   fallback?: string,
-): string {
-  const resolved = value ?? fallback;
-
-  if (resolved === undefined || resolved.length === 0) {
-    throw new Error(`Missing required environment variable: ${name}`);
-  }
-
-  return resolved;
-}
+): string {}
 
 export function getPlatformStackConfig(
killedBy: getLocalPlatformConfig returns the local development defaults
statusReason: expected undefined to be '10.20.0.0/16' // Object.is equality

[Killed] LogicalOperator
packages/platform-config/src/local-env.ts:56:20
   name: string,
   fallback?: string,
 ): string {
-  const resolved = value ?? fallback;
+  const resolved = value && fallback;
 
   if (resolved === undefined || resolved.length === 0) {
killedBy: getLocalPlatformConfig returns the local development defaults
statusReason: Missing required environment variable: CASEMIND_AWS_REGION

[Killed] EqualityOperator
packages/platform-config/src/local-env.ts:58:33
 ): string {
   const resolved = value ?? fallback;
 
-  if (resolved === undefined || resolved.length === 0) {
+  if (resolved === undefined || resolved.length !== 0) {
     throw new Error(`Missing required environment variable: ${name}`);
   }
killedBy: getLocalPlatformConfig returns the local development defaults
statusReason: Missing required environment variable: CASEMIND_AWS_REGION

[Killed] EqualityOperator
packages/platform-config/src/local-env.ts:58:7
 ): string {
   const resolved = value ?? fallback;
 
-  if (resolved === undefined || resolved.length === 0) {
+  if (resolved !== undefined || resolved.length === 0) {
     throw new Error(`Missing required environment variable: ${name}`);
   }
killedBy: getLocalPlatformConfig returns the local development defaults
statusReason: Missing required environment variable: CASEMIND_AWS_REGION

[Survived] StringLiteral
packages/platform-config/src/local-env.ts:72:7
     stage: readStage(env.CASEMIND_STAGE),
     awsRegion: readRequired(
       env.CASEMIND_AWS_REGION,
-      "CASEMIND_AWS_REGION",
+      "",
       "us-gov-west-1",
     ),

[Killed] StringLiteral
packages/platform-config/src/local-env.ts:78:7
     vpcCidr: readRequired(
       env.CASEMIND_VPC_CIDR,
       "CASEMIND_VPC_CIDR",
-      "10.20.0.0/16",
+      "",
     ),
     logRetentionDays: readNumber(env.CASEMIND_LOG_RETENTION_DAYS, 365),
killedBy: getLocalPlatformConfig returns the local development defaults
statusReason: Missing required environment variable: CASEMIND_VPC_CIDR

[Survived] BooleanLiteral
packages/platform-config/src/local-env.ts:82:28
     ),
     logRetentionDays: readNumber(env.CASEMIND_LOG_RETENTION_DAYS, 365),
     tenantKeyStrategy: {
-      enablePerTenantKeys: true,
+      enablePerTenantKeys: false,
       aliasPrefix: "alias/casemind",
       rotationEnabled: true,

[Survived] StringLiteral
packages/platform-config/src/local-env.ts:83:20
     logRetentionDays: readNumber(env.CASEMIND_LOG_RETENTION_DAYS, 365),
     tenantKeyStrategy: {
       enablePerTenantKeys: true,
-      aliasPrefix: "alias/casemind",
+      aliasPrefix: "",
       rotationEnabled: true,
     },

[Survived] BooleanLiteral
packages/platform-config/src/local-env.ts:84:24
     tenantKeyStrategy: {
       enablePerTenantKeys: true,
       aliasPrefix: "alias/casemind",
-      rotationEnabled: true,
+      rotationEnabled: false,
     },
     atlas: {

[Survived] ObjectLiteral
packages/platform-config/src/local-env.ts:86:12
       aliasPrefix: "alias/casemind",
       rotationEnabled: true,
     },
-    atlas: {
-      projectId: env.CASEMIND_ATLAS_PROJECT_ID ?? "local-placeholder",
-      clusterName: env.CASEMIND_ATLAS_CLUSTER_NAME ?? "casemind-local",
-      region: env.CASEMIND_ATLAS_REGION ?? "us-gov-west-1",
-      enablePrivateConnectivity: false,
-      allowedCidrs: ["127.0.0.1/32"],
-      smokeTestUriSecretName:
-        env.CASEMIND_ATLAS_SMOKE_TEST_SECRET_NAME ??
-        "casemind/atlas/smoke-test-uri",
-    },
+    atlas: {},
     data: {
       localObjectStorageEndpoint:

[Survived] LogicalOperator
packages/platform-config/src/local-env.ts:87:18
       rotationEnabled: true,
     },
     atlas: {
-      projectId: env.CASEMIND_ATLAS_PROJECT_ID ?? "local-placeholder",
+      projectId: env.CASEMIND_ATLAS_PROJECT_ID && "local-placeholder",
       clusterName: env.CASEMIND_ATLAS_CLUSTER_NAME ?? "casemind-local",
       region: env.CASEMIND_ATLAS_REGION ?? "us-gov-west-1",

[Survived] LogicalOperator
packages/platform-config/src/local-env.ts:88:20
     },
     atlas: {
       projectId: env.CASEMIND_ATLAS_PROJECT_ID ?? "local-placeholder",
-      clusterName: env.CASEMIND_ATLAS_CLUSTER_NAME ?? "casemind-local",
+      clusterName: env.CASEMIND_ATLAS_CLUSTER_NAME && "casemind-local",
       region: env.CASEMIND_ATLAS_REGION ?? "us-gov-west-1",
       enablePrivateConnectivity: false,

[Survived] LogicalOperator
packages/platform-config/src/local-env.ts:89:15
     atlas: {
       projectId: env.CASEMIND_ATLAS_PROJECT_ID ?? "local-placeholder",
       clusterName: env.CASEMIND_ATLAS_CLUSTER_NAME ?? "casemind-local",
-      region: env.CASEMIND_ATLAS_REGION ?? "us-gov-west-1",
+      region: env.CASEMIND_ATLAS_REGION && "us-gov-west-1",
       enablePrivateConnectivity: false,
       allowedCidrs: ["127.0.0.1/32"],

[Survived] BooleanLiteral
packages/platform-config/src/local-env.ts:90:34
       projectId: env.CASEMIND_ATLAS_PROJECT_ID ?? "local-placeholder",
       clusterName: env.CASEMIND_ATLAS_CLUSTER_NAME ?? "casemind-local",
       region: env.CASEMIND_ATLAS_REGION ?? "us-gov-west-1",
-      enablePrivateConnectivity: false,
+      enablePrivateConnectivity: true,
       allowedCidrs: ["127.0.0.1/32"],
       smokeTestUriSecretName:

[Survived] StringLiteral
packages/platform-config/src/local-env.ts:91:22
       clusterName: env.CASEMIND_ATLAS_CLUSTER_NAME ?? "casemind-local",
       region: env.CASEMIND_ATLAS_REGION ?? "us-gov-west-1",
       enablePrivateConnectivity: false,
-      allowedCidrs: ["127.0.0.1/32"],
+      allowedCidrs: [""],
       smokeTestUriSecretName:
         env.CASEMIND_ATLAS_SMOKE_TEST_SECRET_NAME ??

[Survived] LogicalOperator
packages/platform-config/src/local-env.ts:93:9
       enablePrivateConnectivity: false,
       allowedCidrs: ["127.0.0.1/32"],
       smokeTestUriSecretName:
-        env.CASEMIND_ATLAS_SMOKE_TEST_SECRET_NAME ??
-        "casemind/atlas/smoke-test-uri",
+        env.CASEMIND_ATLAS_SMOKE_TEST_SECRET_NAME && "casemind/atlas/smoke-test-uri",
     },
     data: {

[Survived] LogicalOperator
packages/platform-config/src/local-env.ts:98:9
     },
     data: {
       localObjectStorageEndpoint:
-        env.CASEMIND_OBJECT_STORAGE_ENDPOINT ?? "http://localhost:9000",
+        env.CASEMIND_OBJECT_STORAGE_ENDPOINT && "http://localhost:9000",
       postgresInstanceClass:
         env.CASEMIND_POSTGRES_INSTANCE_CLASS ?? "db.t4g.small",

[Survived] StringLiteral
packages/platform-config/src/local-env.ts:98:49
     },
     data: {
       localObjectStorageEndpoint:
-        env.CASEMIND_OBJECT_STORAGE_ENDPOINT ?? "http://localhost:9000",
+        env.CASEMIND_OBJECT_STORAGE_ENDPOINT ?? "",
       postgresInstanceClass:
         env.CASEMIND_POSTGRES_INSTANCE_CLASS ?? "db.t4g.small",

[Survived] LogicalOperator
packages/platform-config/src/local-env.ts:100:9
       localObjectStorageEndpoint:
         env.CASEMIND_OBJECT_STORAGE_ENDPOINT ?? "http://localhost:9000",
       postgresInstanceClass:
-        env.CASEMIND_POSTGRES_INSTANCE_CLASS ?? "db.t4g.small",
+        env.CASEMIND_POSTGRES_INSTANCE_CLASS && "db.t4g.small",
       postgresStorageGb: readNumber(env.CASEMIND_POSTGRES_STORAGE_GB, 100),
       postgresMultiAz: readBoolean(env.CASEMIND_POSTGRES_MULTI_AZ, true),

[Survived] BooleanLiteral
packages/platform-config/src/local-env.ts:102:68
       postgresInstanceClass:
         env.CASEMIND_POSTGRES_INSTANCE_CLASS ?? "db.t4g.small",
       postgresStorageGb: readNumber(env.CASEMIND_POSTGRES_STORAGE_GB, 100),
-      postgresMultiAz: readBoolean(env.CASEMIND_POSTGRES_MULTI_AZ, true),
+      postgresMultiAz: readBoolean(env.CASEMIND_POSTGRES_MULTI_AZ, false),
       redisNodeType: env.CASEMIND_REDIS_NODE_TYPE ?? "cache.t4g.small",
       redisTransitEncryption: true,

[Survived] LogicalOperator
packages/platform-config/src/local-env.ts:103:22
         env.CASEMIND_POSTGRES_INSTANCE_CLASS ?? "db.t4g.small",
       postgresStorageGb: readNumber(env.CASEMIND_POSTGRES_STORAGE_GB, 100),
       postgresMultiAz: readBoolean(env.CASEMIND_POSTGRES_MULTI_AZ, true),
-      redisNodeType: env.CASEMIND_REDIS_NODE_TYPE ?? "cache.t4g.small",
+      redisNodeType: env.CASEMIND_REDIS_NODE_TYPE && "cache.t4g.small",
       redisTransitEncryption: true,
       redisAtRestEncryption: true,

[Survived] StringLiteral
packages/platform-config/src/local-env.ts:103:54
         env.CASEMIND_POSTGRES_INSTANCE_CLASS ?? "db.t4g.small",
       postgresStorageGb: readNumber(env.CASEMIND_POSTGRES_STORAGE_GB, 100),
       postgresMultiAz: readBoolean(env.CASEMIND_POSTGRES_MULTI_AZ, true),
-      redisNodeType: env.CASEMIND_REDIS_NODE_TYPE ?? "cache.t4g.small",
+      redisNodeType: env.CASEMIND_REDIS_NODE_TYPE ?? "",
       redisTransitEncryption: true,
       redisAtRestEncryption: true,

[Survived] BooleanLiteral
packages/platform-config/src/local-env.ts:104:31
       postgresStorageGb: readNumber(env.CASEMIND_POSTGRES_STORAGE_GB, 100),
       postgresMultiAz: readBoolean(env.CASEMIND_POSTGRES_MULTI_AZ, true),
       redisNodeType: env.CASEMIND_REDIS_NODE_TYPE ?? "cache.t4g.small",
-      redisTransitEncryption: true,
+      redisTransitEncryption: false,
       redisAtRestEncryption: true,
     },

[Survived] BooleanLiteral
packages/platform-config/src/local-env.ts:105:30
       postgresMultiAz: readBoolean(env.CASEMIND_POSTGRES_MULTI_AZ, true),
       redisNodeType: env.CASEMIND_REDIS_NODE_TYPE ?? "cache.t4g.small",
       redisTransitEncryption: true,
-      redisAtRestEncryption: true,
+      redisAtRestEncryption: false,
     },
   };

[Survived] StringLiteral
packages/platform-config/src/local-env.ts:135:9
     objectStorage: {
       endpoint: readRequired(
         env.CASEMIND_OBJECT_STORAGE_ENDPOINT,
-        "CASEMIND_OBJECT_STORAGE_ENDPOINT",
+        "",
         "http://localhost:9000",
       ),

[Survived] StringLiteral
packages/platform-config/src/local-env.ts:140:9
       ),
       region: readRequired(
         env.CASEMIND_OBJECT_STORAGE_REGION,
-        "CASEMIND_OBJECT_STORAGE_REGION",
+        "",
         "us-east-1",
       ),

[Survived] StringLiteral
packages/platform-config/src/local-env.ts:145:9
       ),
       accessKey: readRequired(
         env.CASEMIND_OBJECT_STORAGE_ACCESS_KEY,
-        "CASEMIND_OBJECT_STORAGE_ACCESS_KEY",
+        "",
         "minioadmin",
       ),

[Killed] StringLiteral
packages/platform-config/src/local-env.ts:146:9
       accessKey: readRequired(
         env.CASEMIND_OBJECT_STORAGE_ACCESS_KEY,
         "CASEMIND_OBJECT_STORAGE_ACCESS_KEY",
-        "minioadmin",
+        "",
       ),
       secretKey: readRequired(
killedBy: getLocalPlatformConfig returns the local development defaults
statusReason: Missing required environment variable: CASEMIND_OBJECT_STORAGE_ACCESS_KEY

[Survived] StringLiteral
packages/platform-config/src/local-env.ts:150:9
       ),
       secretKey: readRequired(
         env.CASEMIND_OBJECT_STORAGE_SECRET_KEY,
-        "CASEMIND_OBJECT_STORAGE_SECRET_KEY",
+        "",
         "minioadmin",
       ),

[Survived] BooleanLiteral
packages/platform-config/src/local-env.ts:155:9
       ),
       forcePathStyle: readBoolean(
         env.CASEMIND_OBJECT_STORAGE_FORCE_PATH_STYLE,
-        true,
+        false,
       ),
       buckets: {

[Survived] ConditionalExpression
packages/platform-config/src/local-env.ts:170:9
         ),
       },
     },
-    ...(atlasSmokeTestUri === undefined ? {} : { atlasSmokeTestUri }),
+    ...(false ? {} : { atlasSmokeTestUri }),
   };
 }

[Survived] EqualityOperator
packages/platform-config/src/local-env.ts:170:9
         ),
       },
     },
-    ...(atlasSmokeTestUri === undefined ? {} : { atlasSmokeTestUri }),
+    ...(atlasSmokeTestUri !== undefined ? {} : { atlasSmokeTestUri }),
   };
 }

[Killed] BlockStatement
packages/platform-config/src/local-env.ts:176:24
 
 export function getLocalPlatformConfig(
   env: EnvironmentMap = getDefaultEnv(),
-): LocalPlatformConfig {
-  return {
-    stack: getPlatformStackConfig(env),
-    services: getLocalPlatformServiceContract(env),
-  };
-}
+): LocalPlatformConfig {}
 
killedBy: getLocalPlatformConfig returns the local development defaults
statusReason: Cannot read properties of undefined (reading 'stack')
