[Killed] BlockStatement
auth/src/crypto/password.ts:5:68
 
 const KEY_LENGTH = 64;
 
-function splitHash(hash: string): { salt: string; digest: string } {
-  const parts = hash.split("$");
-
-  if (parts.length !== 3 || parts[0] !== "scrypt") {
-    throw new Error("Unsupported password hash format.");
-  }
-
-  const salt = parts[1];
-  const digest = parts[2];
-
-  if (salt === undefined || digest === undefined) {
-    throw new Error("Invalid password hash payload.");
-  }
-
-  return {
-    salt,
-    digest,
-  };
-}
+function splitHash(hash: string): { salt: string; digest: string } {}
 
 export function hashPassword(password: string): string {
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot destructure property 'salt' of 'splitHash(...)' as it is undefined.

[Killed] EqualityOperator
auth/src/crypto/password.ts:8:7
 function splitHash(hash: string): { salt: string; digest: string } {
   const parts = hash.split("$");
 
-  if (parts.length !== 3 || parts[0] !== "scrypt") {
+  if (parts.length === 3 || parts[0] !== "scrypt") {
     throw new Error("Unsupported password hash format.");
   }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Unsupported password hash format.

[Killed] EqualityOperator
auth/src/crypto/password.ts:8:29
 function splitHash(hash: string): { salt: string; digest: string } {
   const parts = hash.split("$");
 
-  if (parts.length !== 3 || parts[0] !== "scrypt") {
+  if (parts.length !== 3 || parts[0] === "scrypt") {
     throw new Error("Unsupported password hash format.");
   }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Unsupported password hash format.

[Killed] EqualityOperator
auth/src/crypto/password.ts:15:7
   const salt = parts[1];
   const digest = parts[2];
 
-  if (salt === undefined || digest === undefined) {
+  if (salt !== undefined || digest === undefined) {
     throw new Error("Invalid password hash payload.");
   }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Invalid password hash payload.

[Killed] EqualityOperator
auth/src/crypto/password.ts:15:29
   const salt = parts[1];
   const digest = parts[2];
 
-  if (salt === undefined || digest === undefined) {
+  if (salt === undefined || digest !== undefined) {
     throw new Error("Invalid password hash payload.");
   }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Invalid password hash payload.

[NoCoverage] StringLiteral
auth/src/crypto/password.ts:16:21
   const digest = parts[2];
 
   if (salt === undefined || digest === undefined) {
-    throw new Error("Invalid password hash payload.");
+    throw new Error("");
   }
 

[Killed] ObjectLiteral
auth/src/crypto/password.ts:19:10
     throw new Error("Invalid password hash payload.");
   }
 
-  return {
-    salt,
-    digest,
-  };
+  return {};
 }
 
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: The "salt" argument must be of type string or an instance of ArrayBuffer, Buffer, TypedArray, or DataView. Received undefined

[Killed] BlockStatement
auth/src/crypto/password.ts:25:56
   };
 }
 
-export function hashPassword(password: string): string {
-  const salt = randomBytes(16).toString("hex");
-  const digest = scryptSync(password, salt, KEY_LENGTH).toString("hex");
-
-  return `scrypt$${salt}$${digest}`;
-}
+export function hashPassword(password: string): string {}
 
 export function verifyPassword(password: string, hash: string): boolean {
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] StringLiteral
auth/src/crypto/password.ts:29:10
   const salt = randomBytes(16).toString("hex");
   const digest = scryptSync(password, salt, KEY_LENGTH).toString("hex");
 
-  return `scrypt$${salt}$${digest}`;
+  return ``;
 }
 
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Unsupported password hash format.

[Killed] BlockStatement
auth/src/crypto/password.ts:32:73
   return `scrypt$${salt}$${digest}`;
 }
 
-export function verifyPassword(password: string, hash: string): boolean {
-  const { salt, digest } = splitHash(hash);
-  const candidate = scryptSync(password, salt, KEY_LENGTH);
-  const expected = Buffer.from(digest, "hex");
-
-  return timingSafeEqual(candidate, expected);
-}
+export function verifyPassword(password: string, hash: string): boolean {}
 
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: expected 'invalid_credentials' to be 'success' // Object.is equality
