[Killed] BlockStatement
packages/auth/src/env.ts:19:50
 }
 
 function readNumber(value: string | undefined, fallback: number): number {
-  if (value === undefined || value.length === 0) {
-    return fallback;
-  }
+  if (value === undefined || value.length === 0) {}
 
   const parsed = Number(value);
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Expected numeric environment value, received: undefined

[NoCoverage] BlockStatement
packages/auth/src/env.ts:25:33
 
   const parsed = Number(value);
 
-  if (!Number.isFinite(parsed)) {
-    throw new Error(`Expected numeric environment value, received: ${value}`);
-  }
+  if (!Number.isFinite(parsed)) {}
 
   return parsed;

[Survived] BlockStatement
packages/auth/src/env.ts:36:11
   value: string | undefined,
   fallback: string,
   name: string,
-): string {
-  const resolved = value ?? fallback;
-
-  if (resolved.length === 0) {
-    throw new Error(`Missing required environment variable: ${name}`);
-  }
-
-  return resolved;
-}
+): string {}
 
 export function getLocalAuthConfig(

[Killed] ConditionalExpression
packages/auth/src/env.ts:39:7
 ): string {
   const resolved = value ?? fallback;
 
-  if (resolved.length === 0) {
+  if (true) {
     throw new Error(`Missing required environment variable: ${name}`);
   }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Missing required environment variable: CASEMIND_AUTH_ISSUER

[Killed] EqualityOperator
packages/auth/src/env.ts:39:7
 ): string {
   const resolved = value ?? fallback;
 
-  if (resolved.length === 0) {
+  if (resolved.length !== 0) {
     throw new Error(`Missing required environment variable: ${name}`);
   }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Missing required environment variable: CASEMIND_AUTH_ISSUER

[Survived] StringLiteral
packages/auth/src/env.ts:63:7
     sessionCookieName: readRequired(
       env.CASEMIND_AUTH_SESSION_COOKIE_NAME,
       "casemind-session",
-      "CASEMIND_AUTH_SESSION_COOKIE_NAME",
+      "",
     ),
     sessionPolicy: {

[Survived] ConditionalExpression
packages/auth/src/env.ts:79:9
         DEFAULT_SESSION_POLICY.maxFailedAttempts,
       ),
       secureCookies:
-        env.NODE_ENV === "production"
+        false
           ? true
           : DEFAULT_SESSION_POLICY.secureCookies,

[Survived] EqualityOperator
packages/auth/src/env.ts:79:9
         DEFAULT_SESSION_POLICY.maxFailedAttempts,
       ),
       secureCookies:
-        env.NODE_ENV === "production"
+        env.NODE_ENV !== "production"
           ? true
           : DEFAULT_SESSION_POLICY.secureCookies,

[NoCoverage] BooleanLiteral
packages/auth/src/env.ts:80:13
       ),
       secureCookies:
         env.NODE_ENV === "production"
-          ? true
+          ? false
           : DEFAULT_SESSION_POLICY.secureCookies,
     },

[Killed] StringLiteral
packages/auth/src/env.ts:85:7
     },
     syntheticTenantId: readRequired(
       env.CASEMIND_AUTH_SYNTHETIC_TENANT_ID,
-      "tenant-local-demo",
+      "",
       "CASEMIND_AUTH_SYNTHETIC_TENANT_ID",
     ),
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Missing required environment variable: CASEMIND_AUTH_SYNTHETIC_TENANT_ID

[Killed] StringLiteral
packages/auth/src/env.ts:90:7
     ),
     syntheticPassword: readRequired(
       env.CASEMIND_AUTH_SYNTHETIC_PASSWORD,
-      "CaseMindLocal!23",
+      "",
       "CASEMIND_AUTH_SYNTHETIC_PASSWORD",
     ),
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Missing required environment variable: CASEMIND_AUTH_SYNTHETIC_PASSWORD
