[Killed] BlockStatement
auth/src/mfa/totp.ts:21:66
   deleteSecret(secretRef: string): void;
 }
 
-export function createInMemoryTotpSecretStore(): TotpSecretStore {
-  const secrets = new Map<string, string>();
-
-  return {
-    saveSecret(userId, secret) {
-      const secretRef = `totp:${userId}:${randomUUID()}`;
-      secrets.set(secretRef, secret);
-      return secretRef;
-    },
-    getSecret(secretRef) {
-      return secrets.get(secretRef);
-    },
-    deleteSecret(secretRef) {
-      secrets.delete(secretRef);
-    },
-  };
-}
+export function createInMemoryTotpSecretStore(): TotpSecretStore {}
 
 export function encodeBase32Bytes(buffer: Uint8Array): string {
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Cannot read properties of undefined (reading 'saveSecret')

[Killed] ObjectLiteral
auth/src/mfa/totp.ts:24:10
 export function createInMemoryTotpSecretStore(): TotpSecretStore {
   const secrets = new Map<string, string>();
 
-  return {
-    saveSecret(userId, secret) {
-      const secretRef = `totp:${userId}:${randomUUID()}`;
-      secrets.set(secretRef, secret);
-      return secretRef;
-    },
-    getSecret(secretRef) {
-      return secrets.get(secretRef);
-    },
-    deleteSecret(secretRef) {
-      secrets.delete(secretRef);
-    },
-  };
+  return {};
 }
 
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: options.secretStore.saveSecret is not a function

[Killed] BlockStatement
auth/src/mfa/totp.ts:25:32
   const secrets = new Map<string, string>();
 
   return {
-    saveSecret(userId, secret) {
-      const secretRef = `totp:${userId}:${randomUUID()}`;
-      secrets.set(secretRef, secret);
-      return secretRef;
-    },
+    saveSecret(userId, secret) {},
     getSecret(secretRef) {
       return secrets.get(secretRef);
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Unknown TOTP secret reference: undefined

[Survived] StringLiteral
auth/src/mfa/totp.ts:26:25
 
   return {
     saveSecret(userId, secret) {
-      const secretRef = `totp:${userId}:${randomUUID()}`;
+      const secretRef = ``;
       secrets.set(secretRef, secret);
       return secretRef;

[Killed] BlockStatement
auth/src/mfa/totp.ts:30:26
       secrets.set(secretRef, secret);
       return secretRef;
     },
-    getSecret(secretRef) {
-      return secrets.get(secretRef);
-    },
+    getSecret(secretRef) {},
     deleteSecret(secretRef) {
       secrets.delete(secretRef);
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Unknown TOTP secret reference: totp:usr-apa:ad7c5b3a-c7bd-4849-ad40-2ff8fc2992ed

[NoCoverage] BlockStatement
auth/src/mfa/totp.ts:33:29
     getSecret(secretRef) {
       return secrets.get(secretRef);
     },
-    deleteSecret(secretRef) {
-      secrets.delete(secretRef);
-    },
+    deleteSecret(secretRef) {},
   };
 }

[Killed] BlockStatement
auth/src/mfa/totp.ts:39:63
   };
 }
 
-export function encodeBase32Bytes(buffer: Uint8Array): string {
-  let bits = 0;
-  let value = 0;
-  let output = "";
-
-  for (const byte of buffer) {
-    value = (value << 8) | byte;
-    bits += 8;
-
-    while (bits >= 5) {
-      output += BASE32_ALPHABET[(value >>> (bits - 5)) & 31];
-      bits -= 5;
-    }
-  }
-
-  if (bits > 0) {
-    output += BASE32_ALPHABET[(value << (5 - bits)) & 31];
-  }
-
-  return output;
-}
+export function encodeBase32Bytes(buffer: Uint8Array): string {}
 
 export function decodeBase32Bytes(secret: string): Buffer {
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Cannot read properties of undefined (reading 'replaceAll')

[Killed] StringLiteral
auth/src/mfa/totp.ts:42:16
 export function encodeBase32Bytes(buffer: Uint8Array): string {
   let bits = 0;
   let value = 0;
-  let output = "";
+  let output = "Stryker was here!";
 
   for (const byte of buffer) {
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Invalid base32 character:

[Killed] BlockStatement
auth/src/mfa/totp.ts:44:30
   let value = 0;
   let output = "";
 
-  for (const byte of buffer) {
-    value = (value << 8) | byte;
-    bits += 8;
-
-    while (bits >= 5) {
-      output += BASE32_ALPHABET[(value >>> (bits - 5)) & 31];
-      bits -= 5;
-    }
-  }
+  for (const byte of buffer) {}
 
   if (bits > 0) {
killedBy: TOTP enrollment round-trips arbitrary bytes through the base32 codec
statusReason: Property failed after 1 tests
{ seed: 1734414901, path: "0:1", endOnFailure: true }
Counterexample: [Uint8Array.from([0])]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] AssignmentOperator
auth/src/mfa/totp.ts:46:5
 
   for (const byte of buffer) {
     value = (value << 8) | byte;
-    bits += 8;
+    bits -= 8;
 
     while (bits >= 5) {
killedBy: TOTP enrollment round-trips arbitrary bytes through the base32 codec
statusReason: Property failed after 1 tests
{ seed: 96359756, path: "0:1:1", endOnFailure: true }
Counterexample: [Uint8Array.from([0])]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
auth/src/mfa/totp.ts:48:12
     value = (value << 8) | byte;
     bits += 8;
 
-    while (bits >= 5) {
+    while (false) {
       output += BASE32_ALPHABET[(value >>> (bits - 5)) & 31];
       bits -= 5;
killedBy: TOTP enrollment round-trips arbitrary bytes through the base32 codec
statusReason: Property failed after 1 tests
{ seed: 253813856, path: "0:1:0:0:1", endOnFailure: true }
Counterexample: [Uint8Array.from([0])]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
auth/src/mfa/totp.ts:48:12
     value = (value << 8) | byte;
     bits += 8;
 
-    while (bits >= 5) {
+    while (bits < 5) {
       output += BASE32_ALPHABET[(value >>> (bits - 5)) & 31];
       bits -= 5;
killedBy: TOTP enrollment round-trips arbitrary bytes through the base32 codec
statusReason: Property failed after 1 tests
{ seed: -1835234396, path: "0:1:0:1", endOnFailure: true }
Counterexample: [Uint8Array.from([0])]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] AssignmentOperator
auth/src/mfa/totp.ts:49:7
     bits += 8;
 
     while (bits >= 5) {
-      output += BASE32_ALPHABET[(value >>> (bits - 5)) & 31];
+      output -= BASE32_ALPHABET[value >>> bits - 5 & 31];
       bits -= 5;
     }
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: secret.replaceAll is not a function

[Killed] ArithmeticOperator
auth/src/mfa/totp.ts:49:45
     bits += 8;
 
     while (bits >= 5) {
-      output += BASE32_ALPHABET[(value >>> (bits - 5)) & 31];
+      output += BASE32_ALPHABET[(value >>> (bits + 5)) & 31];
       bits -= 5;
     }
killedBy: TOTP enrollment round-trips arbitrary bytes through the base32 codec
statusReason: Property failed after 1 tests
{ seed: 2044758589, path: "0:1:0:2:1", endOnFailure: true }
Counterexample: [Uint8Array.from([8])]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Timeout] AssignmentOperator
auth/src/mfa/totp.ts:50:7
 
     while (bits >= 5) {
       output += BASE32_ALPHABET[(value >>> (bits - 5)) & 31];
-      bits -= 5;
+      bits += 5;
     }
   }

[Killed] EqualityOperator
auth/src/mfa/totp.ts:54:7
     }
   }
 
-  if (bits > 0) {
+  if (bits <= 0) {
     output += BASE32_ALPHABET[(value << (5 - bits)) & 31];
   }
killedBy: TOTP enrollment round-trips arbitrary bytes through the base32 codec
statusReason: Property failed after 1 tests
{ seed: 1904971750, path: "0:1:0:0:1", endOnFailure: true }
Counterexample: [Uint8Array.from([0])]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
auth/src/mfa/totp.ts:54:17
     }
   }
 
-  if (bits > 0) {
-    output += BASE32_ALPHABET[(value << (5 - bits)) & 31];
-  }
+  if (bits > 0) {}
 
   return output;
killedBy: TOTP enrollment round-trips arbitrary bytes through the base32 codec
statusReason: Property failed after 1 tests
{ seed: 1759153186, path: "0:1:0:0:1", endOnFailure: true }
Counterexample: [Uint8Array.from([0])]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
auth/src/mfa/totp.ts:55:42
   }
 
   if (bits > 0) {
-    output += BASE32_ALPHABET[(value << (5 - bits)) & 31];
+    output += BASE32_ALPHABET[(value << (5 + bits)) & 31];
   }
 
killedBy: TOTP enrollment round-trips arbitrary bytes through the base32 codec
statusReason: Property failed after 2 tests
{ seed: -409553027, path: "1:1:2:1:1:2:1:1", endOnFailure: true }
Counterexample: [Uint8Array.from([9])]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] AssignmentOperator
auth/src/mfa/totp.ts:55:5
   }
 
   if (bits > 0) {
-    output += BASE32_ALPHABET[(value << (5 - bits)) & 31];
+    output -= BASE32_ALPHABET[value << 5 - bits & 31];
   }
 
killedBy: TOTP enrollment round-trips arbitrary bytes through the base32 codec
statusReason: Property failed after 1 tests
{ seed: 200135322, path: "0:1:1", endOnFailure: true }
Counterexample: [Uint8Array.from([0])]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
auth/src/mfa/totp.ts:61:59
   return output;
 }
 
-export function decodeBase32Bytes(secret: string): Buffer {
-  let bits = 0;
-  let value = 0;
-  const output: number[] = [];
-
-  for (const character of secret.replaceAll("=", "").toUpperCase()) {
-    const index = BASE32_ALPHABET.indexOf(character);
-
-    if (index < 0) {
-      throw new Error(`Invalid base32 character: ${character}`);
-    }
-
-    value = (value << 5) | index;
-    bits += 5;
-
-    if (bits >= 8) {
-      output.push((value >>> (bits - 8)) & 255);
-      bits -= 8;
-    }
-  }
-
-  return Buffer.from(output);
-}
+export function decodeBase32Bytes(secret: string): Buffer {}
 
 function buildHotp(secret: string, counter: number, digits: number): string {
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: The "key" argument must be of type string or an instance of ArrayBuffer, Buffer, TypedArray, DataView, KeyObject, or CryptoKey. Received undefined

[Killed] ArrayDeclaration
auth/src/mfa/totp.ts:64:28
 export function decodeBase32Bytes(secret: string): Buffer {
   let bits = 0;
   let value = 0;
-  const output: number[] = [];
+  const output: number[] = ["Stryker was here"];
 
   for (const character of secret.replaceAll("=", "").toUpperCase()) {
killedBy: TOTP enrollment round-trips arbitrary bytes through the base32 codec
statusReason: Property failed after 1 tests
{ seed: -627315281, path: "0:0", endOnFailure: true }
Counterexample: [Uint8Array.from([])]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
auth/src/mfa/totp.ts:66:69
   let value = 0;
   const output: number[] = [];
 
-  for (const character of secret.replaceAll("=", "").toUpperCase()) {
-    const index = BASE32_ALPHABET.indexOf(character);
-
-    if (index < 0) {
-      throw new Error(`Invalid base32 character: ${character}`);
-    }
-
-    value = (value << 5) | index;
-    bits += 5;
-
-    if (bits >= 8) {
-      output.push((value >>> (bits - 8)) & 255);
-      bits -= 8;
-    }
-  }
+  for (const character of secret.replaceAll("=", "").toUpperCase()) {}
 
   return Buffer.from(output);
killedBy: TOTP enrollment round-trips arbitrary bytes through the base32 codec
statusReason: Property failed after 1 tests
{ seed: -231518592, path: "0:1:0:0:1", endOnFailure: true }
Counterexample: [Uint8Array.from([0])]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
auth/src/mfa/totp.ts:66:27
   let value = 0;
   const output: number[] = [];
 
-  for (const character of secret.replaceAll("=", "").toUpperCase()) {
+  for (const character of secret.replaceAll("=", "").toLowerCase()) {
     const index = BASE32_ALPHABET.indexOf(character);
 
killedBy: TOTP enrollment generates and verifies a TOTP code
statusReason: Invalid base32 character: w

[Killed] EqualityOperator
auth/src/mfa/totp.ts:69:9
   for (const character of secret.replaceAll("=", "").toUpperCase()) {
     const index = BASE32_ALPHABET.indexOf(character);
 
-    if (index < 0) {
+    if (index <= 0) {
       throw new Error(`Invalid base32 character: ${character}`);
     }
killedBy: TOTP enrollment generates and verifies a TOTP code
statusReason: Invalid base32 character: A

[Killed] ConditionalExpression
auth/src/mfa/totp.ts:69:9
   for (const character of secret.replaceAll("=", "").toUpperCase()) {
     const index = BASE32_ALPHABET.indexOf(character);
 
-    if (index < 0) {
+    if (true) {
       throw new Error(`Invalid base32 character: ${character}`);
     }
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Invalid base32 character: O

[Killed] AssignmentOperator
auth/src/mfa/totp.ts:74:5
     }
 
     value = (value << 5) | index;
-    bits += 5;
+    bits -= 5;
 
     if (bits >= 8) {
killedBy: TOTP enrollment round-trips arbitrary bytes through the base32 codec
statusReason: Property failed after 1 tests
{ seed: -1506571592, path: "0:1:0", endOnFailure: true }
Counterexample: [Uint8Array.from([0])]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
auth/src/mfa/totp.ts:76:9
     value = (value << 5) | index;
     bits += 5;
 
-    if (bits >= 8) {
+    if (true) {
       output.push((value >>> (bits - 8)) & 255);
       bits -= 8;
killedBy: TOTP enrollment round-trips arbitrary bytes through the base32 codec
statusReason: Property failed after 1 tests
{ seed: 786080846, path: "0:1:0:0:1", endOnFailure: true }
Counterexample: [Uint8Array.from([0])]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
auth/src/mfa/totp.ts:76:20
     value = (value << 5) | index;
     bits += 5;
 
-    if (bits >= 8) {
-      output.push((value >>> (bits - 8)) & 255);
-      bits -= 8;
-    }
+    if (bits >= 8) {}
   }
 
killedBy: TOTP enrollment round-trips arbitrary bytes through the base32 codec
statusReason: Property failed after 1 tests
{ seed: 528534867, path: "0:1:1", endOnFailure: true }
Counterexample: [Uint8Array.from([0])]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
auth/src/mfa/totp.ts:77:31
     bits += 5;
 
     if (bits >= 8) {
-      output.push((value >>> (bits - 8)) & 255);
+      output.push((value >>> (bits + 8)) & 255);
       bits -= 8;
     }
killedBy: TOTP enrollment round-trips arbitrary bytes through the base32 codec
statusReason: Property failed after 2 tests
{ seed: -844836161, path: "1:2:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [Uint8Array.from([1])]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] AssignmentOperator
auth/src/mfa/totp.ts:78:7
 
     if (bits >= 8) {
       output.push((value >>> (bits - 8)) & 255);
-      bits -= 8;
+      bits += 8;
     }
   }
killedBy: TOTP enrollment round-trips arbitrary bytes through the base32 codec
statusReason: Property failed after 1 tests
{ seed: -1816447134, path: "0:2", endOnFailure: true }
Counterexample: [Uint8Array.from([0,0])]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
auth/src/mfa/totp.ts:89:29
   const counterBuffer = Buffer.alloc(8);
   counterBuffer.writeBigUInt64BE(BigInt(counter));
 
-  const digest = createHmac("sha1", decodeBase32Bytes(secret))
+  const digest = createHmac("", decodeBase32Bytes(secret))
     .update(counterBuffer)
     .digest();
killedBy: TOTP enrollment generates and verifies a TOTP code
statusReason: Invalid digest:

[Survived] UnaryOperator
auth/src/mfa/totp.ts:92:30
   const digest = createHmac("sha1", decodeBase32Bytes(secret))
     .update(counterBuffer)
     .digest();
-  const lastByte = digest.at(-1);
+  const lastByte = digest.at(+1);
 
   if (lastByte === undefined) {

[Killed] ConditionalExpression
auth/src/mfa/totp.ts:94:7
     .digest();
   const lastByte = digest.at(-1);
 
-  if (lastByte === undefined) {
+  if (true) {
     throw new Error("Failed to generate HOTP digest.");
   }
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Failed to generate HOTP digest.

[Killed] EqualityOperator
auth/src/mfa/totp.ts:94:7
     .digest();
   const lastByte = digest.at(-1);
 
-  if (lastByte === undefined) {
+  if (lastByte !== undefined) {
     throw new Error("Failed to generate HOTP digest.");
   }
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Failed to generate HOTP digest.

[NoCoverage] StringLiteral
auth/src/mfa/totp.ts:95:21
   const lastByte = digest.at(-1);
 
   if (lastByte === undefined) {
-    throw new Error("Failed to generate HOTP digest.");
+    throw new Error("");
   }
 

[Killed] ArithmeticOperator
auth/src/mfa/totp.ts:100:25
 
   const offset = lastByte & 15;
   const first = digest[offset];
-  const second = digest[offset + 1];
+  const second = digest[offset - 1];
   const third = digest[offset + 2];
   const fourth = digest[offset + 3];
killedBy: TOTP enrollment activates MFA and issues recovery codes
statusReason: Invalid HOTP digest window.

[Survived] ArithmeticOperator
auth/src/mfa/totp.ts:101:24
   const offset = lastByte & 15;
   const first = digest[offset];
   const second = digest[offset + 1];
-  const third = digest[offset + 2];
+  const third = digest[offset - 2];
   const fourth = digest[offset + 3];
 

[Killed] ArithmeticOperator
auth/src/mfa/totp.ts:102:25
   const first = digest[offset];
   const second = digest[offset + 1];
   const third = digest[offset + 2];
-  const fourth = digest[offset + 3];
+  const fourth = digest[offset - 3];
 
   if (
killedBy: TOTP enrollment generates and verifies a TOTP code
statusReason: Invalid HOTP digest window.

[Killed] ConditionalExpression
auth/src/mfa/totp.ts:105:5
   const fourth = digest[offset + 3];
 
   if (
-    first === undefined ||
-    second === undefined ||
-    third === undefined ||
-    fourth === undefined
+    true
   ) {
     throw new Error("Invalid HOTP digest window.");
killedBy: TOTP enrollment generates and verifies a TOTP code
statusReason: Invalid HOTP digest window.

[Killed] EqualityOperator
auth/src/mfa/totp.ts:105:5
   const fourth = digest[offset + 3];
 
   if (
-    first === undefined ||
+    first !== undefined ||
     second === undefined ||
     third === undefined ||
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Invalid HOTP digest window.

[Killed] EqualityOperator
auth/src/mfa/totp.ts:106:5
 
   if (
     first === undefined ||
-    second === undefined ||
+    second !== undefined ||
     third === undefined ||
     fourth === undefined
killedBy: TOTP enrollment generates and verifies a TOTP code
statusReason: Invalid HOTP digest window.

[Survived] ConditionalExpression
auth/src/mfa/totp.ts:106:5
 
   if (
     first === undefined ||
-    second === undefined ||
+    false ||
     third === undefined ||
     fourth === undefined

[Killed] EqualityOperator
auth/src/mfa/totp.ts:107:5
   if (
     first === undefined ||
     second === undefined ||
-    third === undefined ||
+    third !== undefined ||
     fourth === undefined
   ) {
killedBy: TOTP enrollment generates and verifies a TOTP code
statusReason: Invalid HOTP digest window.

[Survived] ConditionalExpression
auth/src/mfa/totp.ts:107:5
   if (
     first === undefined ||
     second === undefined ||
-    third === undefined ||
+    false ||
     fourth === undefined
   ) {

[Killed] EqualityOperator
auth/src/mfa/totp.ts:108:5
     first === undefined ||
     second === undefined ||
     third === undefined ||
-    fourth === undefined
+    fourth !== undefined
   ) {
     throw new Error("Invalid HOTP digest window.");
killedBy: TOTP enrollment generates and verifies a TOTP code
statusReason: Invalid HOTP digest window.

[Survived] ConditionalExpression
auth/src/mfa/totp.ts:108:5
     first === undefined ||
     second === undefined ||
     third === undefined ||
-    fourth === undefined
+    false
   ) {
     throw new Error("Invalid HOTP digest window.");

[NoCoverage] BlockStatement
auth/src/mfa/totp.ts:109:5
     second === undefined ||
     third === undefined ||
     fourth === undefined
-  ) {
-    throw new Error("Invalid HOTP digest window.");
-  }
+  ) {}
 
   const binaryCode =

[Survived] ArithmeticOperator
auth/src/mfa/totp.ts:116:11
   const binaryCode =
     ((first & 127) << 24) | (second << 16) | (third << 8) | fourth;
 
-  return (binaryCode % 10 ** digits).toString().padStart(digits, "0");
+  return (binaryCode * 10 ** digits).toString().padStart(digits, "0");
 }
 

[Survived] StringLiteral
auth/src/mfa/totp.ts:116:66
   const binaryCode =
     ((first & 127) << 24) | (second << 16) | (third << 8) | fourth;
 
-  return (binaryCode % 10 ** digits).toString().padStart(digits, "0");
+  return (binaryCode % 10 ** digits).toString().padStart(digits, "");
 }
 

[Killed] BlockStatement
auth/src/mfa/totp.ts:119:64
   return (binaryCode % 10 ** digits).toString().padStart(digits, "0");
 }
 
-export function generateTotpSecret(bytes: number = 20): string {
-  return encodeBase32Bytes(randomBytes(bytes));
-}
+export function generateTotpSecret(bytes: number = 20): string {}
 
 export function buildOtpAuthUri(options: {
killedBy: TOTP enrollment generates and verifies a TOTP code
statusReason: Cannot read properties of undefined (reading 'replaceAll')

[Survived] BlockStatement
auth/src/mfa/totp.ts:129:12
   accountName: string;
   digits?: number;
   periodSeconds?: number;
-}): string {
-  const digits = options.digits ?? DEFAULT_DIGITS;
-  const periodSeconds = options.periodSeconds ?? DEFAULT_PERIOD_SECONDS;
-  const label = `${options.issuer}:${options.accountName}`;
-
-  return `otpauth://totp/${encodeURIComponent(label)}?secret=${options.secret}&issuer=${encodeURIComponent(options.issuer)}&algorithm=SHA1&digits=${digits}&period=${periodSeconds}`;
-}
+}): string {}
 
 export function generateTotpCode(

[Survived] LogicalOperator
auth/src/mfa/totp.ts:130:18
   digits?: number;
   periodSeconds?: number;
 }): string {
-  const digits = options.digits ?? DEFAULT_DIGITS;
+  const digits = options.digits && DEFAULT_DIGITS;
   const periodSeconds = options.periodSeconds ?? DEFAULT_PERIOD_SECONDS;
   const label = `${options.issuer}:${options.accountName}`;

[Survived] LogicalOperator
auth/src/mfa/totp.ts:131:25
   periodSeconds?: number;
 }): string {
   const digits = options.digits ?? DEFAULT_DIGITS;
-  const periodSeconds = options.periodSeconds ?? DEFAULT_PERIOD_SECONDS;
+  const periodSeconds = options.periodSeconds && DEFAULT_PERIOD_SECONDS;
   const label = `${options.issuer}:${options.accountName}`;
 

[Survived] StringLiteral
auth/src/mfa/totp.ts:132:17
 }): string {
   const digits = options.digits ?? DEFAULT_DIGITS;
   const periodSeconds = options.periodSeconds ?? DEFAULT_PERIOD_SECONDS;
-  const label = `${options.issuer}:${options.accountName}`;
+  const label = ``;
 
   return `otpauth://totp/${encodeURIComponent(label)}?secret=${options.secret}&issuer=${encodeURIComponent(options.issuer)}&algorithm=SHA1&digits=${digits}&period=${periodSeconds}`;

[Killed] BlockStatement
auth/src/mfa/totp.ts:142:11
   time: Date = new Date(),
   digits: number = DEFAULT_DIGITS,
   periodSeconds: number = DEFAULT_PERIOD_SECONDS,
-): string {
-  const counter = Math.floor(time.getTime() / 1000 / periodSeconds);
-
-  return buildHotp(secret, counter, digits);
-}
+): string {}
 
 export function verifyTotpCode(
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ArithmeticOperator
auth/src/mfa/totp.ts:143:30
   digits: number = DEFAULT_DIGITS,
   periodSeconds: number = DEFAULT_PERIOD_SECONDS,
 ): string {
-  const counter = Math.floor(time.getTime() / 1000 / periodSeconds);
+  const counter = Math.floor(time.getTime() * 1000 / periodSeconds);
 
   return buildHotp(secret, counter, digits);
killedBy: TOTP enrollment generates and verifies a TOTP code
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
auth/src/mfa/totp.ts:143:30
   digits: number = DEFAULT_DIGITS,
   periodSeconds: number = DEFAULT_PERIOD_SECONDS,
 ): string {
-  const counter = Math.floor(time.getTime() / 1000 / periodSeconds);
+  const counter = Math.floor(time.getTime() / 1000 * periodSeconds);
 
   return buildHotp(secret, counter, digits);
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Invalid TOTP code.

[Killed] BlockStatement
auth/src/mfa/totp.ts:155:12
   window: number = DEFAULT_WINDOW,
   digits: number = DEFAULT_DIGITS,
   periodSeconds: number = DEFAULT_PERIOD_SECONDS,
-): boolean {
-  const normalizedCode = code.trim();
-  const currentCounter = Math.floor(time.getTime() / 1000 / periodSeconds);
-
-  for (let offset = -window; offset <= window; offset += 1) {
-    const candidate = buildHotp(secret, currentCounter + offset, digits);
-
-    if (candidate === normalizedCode) {
-      return true;
-    }
-  }
-
-  return false;
-}
+): boolean {}
 
 function resolveSecret(
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Invalid TOTP code.

[Survived] MethodExpression
auth/src/mfa/totp.ts:156:26
   digits: number = DEFAULT_DIGITS,
   periodSeconds: number = DEFAULT_PERIOD_SECONDS,
 ): boolean {
-  const normalizedCode = code.trim();
+  const normalizedCode = code;
   const currentCounter = Math.floor(time.getTime() / 1000 / periodSeconds);
 

[Killed] ArithmeticOperator
auth/src/mfa/totp.ts:157:37
   periodSeconds: number = DEFAULT_PERIOD_SECONDS,
 ): boolean {
   const normalizedCode = code.trim();
-  const currentCounter = Math.floor(time.getTime() / 1000 / periodSeconds);
+  const currentCounter = Math.floor(time.getTime() * 1000 / periodSeconds);
 
   for (let offset = -window; offset <= window; offset += 1) {
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Invalid TOTP code.

[Killed] ArithmeticOperator
auth/src/mfa/totp.ts:157:37
   periodSeconds: number = DEFAULT_PERIOD_SECONDS,
 ): boolean {
   const normalizedCode = code.trim();
-  const currentCounter = Math.floor(time.getTime() / 1000 / periodSeconds);
+  const currentCounter = Math.floor(time.getTime() / 1000 * periodSeconds);
 
   for (let offset = -window; offset <= window; offset += 1) {
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Invalid TOTP code.

[Killed] ConditionalExpression
auth/src/mfa/totp.ts:159:30
   const normalizedCode = code.trim();
   const currentCounter = Math.floor(time.getTime() / 1000 / periodSeconds);
 
-  for (let offset = -window; offset <= window; offset += 1) {
+  for (let offset = -window; false; offset += 1) {
     const candidate = buildHotp(secret, currentCounter + offset, digits);
 
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Invalid TOTP code.

[Killed] EqualityOperator
auth/src/mfa/totp.ts:159:30
   const normalizedCode = code.trim();
   const currentCounter = Math.floor(time.getTime() / 1000 / periodSeconds);
 
-  for (let offset = -window; offset <= window; offset += 1) {
+  for (let offset = -window; offset > window; offset += 1) {
     const candidate = buildHotp(secret, currentCounter + offset, digits);
 
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Invalid TOTP code.

[Survived] ArithmeticOperator
auth/src/mfa/totp.ts:160:41
   const currentCounter = Math.floor(time.getTime() / 1000 / periodSeconds);
 
   for (let offset = -window; offset <= window; offset += 1) {
-    const candidate = buildHotp(secret, currentCounter + offset, digits);
+    const candidate = buildHotp(secret, currentCounter - offset, digits);
 
     if (candidate === normalizedCode) {

[Killed] ConditionalExpression
auth/src/mfa/totp.ts:162:9
   for (let offset = -window; offset <= window; offset += 1) {
     const candidate = buildHotp(secret, currentCounter + offset, digits);
 
-    if (candidate === normalizedCode) {
+    if (false) {
       return true;
     }
killedBy: TOTP enrollment generates and verifies a TOTP code
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
auth/src/mfa/totp.ts:162:39
   for (let offset = -window; offset <= window; offset += 1) {
     const candidate = buildHotp(secret, currentCounter + offset, digits);
 
-    if (candidate === normalizedCode) {
-      return true;
-    }
+    if (candidate === normalizedCode) {}
   }
 
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Invalid TOTP code.
