[Killed] BooleanLiteral
auth/src/mfa/totp.ts:163:14
     const candidate = buildHotp(secret, currentCounter + offset, digits);
 
     if (candidate === normalizedCode) {
-      return true;
+      return false;
     }
   }
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Invalid TOTP code.

[Killed] BlockStatement
auth/src/mfa/totp.ts:173:11
 function resolveSecret(
   state: TotpEnrollmentState,
   secretStore: TotpSecretStore,
-): string {
-  const secret = secretStore.getSecret(state.secretRef);
-
-  if (secret === undefined) {
-    throw new Error(`Unknown TOTP secret reference: ${state.secretRef}`);
-  }
-
-  return secret;
-}
+): string {}
 
 export function startTotpEnrollment(options: {
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Cannot read properties of undefined (reading 'replaceAll')

[Killed] ConditionalExpression
auth/src/mfa/totp.ts:176:7
 ): string {
   const secret = secretStore.getSecret(state.secretRef);
 
-  if (secret === undefined) {
+  if (true) {
     throw new Error(`Unknown TOTP secret reference: ${state.secretRef}`);
   }
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Unknown TOTP secret reference: totp:usr-apa:eadb194a-73fd-4c58-95eb-93748f72cb7d

[Killed] EqualityOperator
auth/src/mfa/totp.ts:176:7
 ): string {
   const secret = secretStore.getSecret(state.secretRef);
 
-  if (secret === undefined) {
+  if (secret !== undefined) {
     throw new Error(`Unknown TOTP secret reference: ${state.secretRef}`);
   }
killedBy: TOTP enrollment generates and verifies a TOTP code
statusReason: Unknown TOTP secret reference: totp:usr-1:b8dc748b-3c69-4c99-abd1-50ccd2fd2ea8

[NoCoverage] StringLiteral
auth/src/mfa/totp.ts:177:21
   const secret = secretStore.getSecret(state.secretRef);
 
   if (secret === undefined) {
-    throw new Error(`Unknown TOTP secret reference: ${state.secretRef}`);
+    throw new Error(``);
   }
 

[Killed] BlockStatement
auth/src/mfa/totp.ts:189:25
   accountName: string;
   secretStore: TotpSecretStore;
   now?: Date;
-}): TotpEnrollmentStart {
-  const secret = generateTotpSecret();
-  const secretRef = options.secretStore.saveSecret(options.userId, secret);
-  const enrolledAt = (options.now ?? new Date()).toISOString();
-  const state: TotpEnrollmentState = {
-    userId: options.userId,
-    secretRef,
-    recoveryCodeHashes: [],
-    enrolledAt,
-  };
-
-  return {
-    state,
-    secret,
-    otpauthUri: buildOtpAuthUri({
-      secret,
-      issuer: options.issuer,
-      accountName: options.accountName,
-    }),
-  };
-}
+}): TotpEnrollmentStart {}
 
 export function activateTotpEnrollment(options: {
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Cannot read properties of undefined (reading 'state')

[Survived] LogicalOperator
auth/src/mfa/totp.ts:192:23
 }): TotpEnrollmentStart {
   const secret = generateTotpSecret();
   const secretRef = options.secretStore.saveSecret(options.userId, secret);
-  const enrolledAt = (options.now ?? new Date()).toISOString();
+  const enrolledAt = (options.now && new Date()).toISOString();
   const state: TotpEnrollmentState = {
     userId: options.userId,

[Killed] ObjectLiteral
auth/src/mfa/totp.ts:193:38
   const secret = generateTotpSecret();
   const secretRef = options.secretStore.saveSecret(options.userId, secret);
   const enrolledAt = (options.now ?? new Date()).toISOString();
-  const state: TotpEnrollmentState = {
-    userId: options.userId,
-    secretRef,
-    recoveryCodeHashes: [],
-    enrolledAt,
-  };
+  const state: TotpEnrollmentState = {};
 
   return {
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: state.recoveryCodeHashes is not iterable

[Killed] BlockStatement
auth/src/mfa/totp.ts:217:30
   secretStore: TotpSecretStore;
   now?: Date;
   recoveryCodeCount?: number;
-}): TotpEnrollmentActivation {
-  const now = options.now ?? new Date();
-  const secret = resolveSecret(options.state, options.secretStore);
-
-  if (!verifyTotpCode(secret, options.code, now)) {
-    throw new Error("Invalid TOTP code.");
-  }
-
-  const recoveryCodes = generateRecoveryCodes(options.recoveryCodeCount ?? 10);
-  const state: TotpEnrollmentState = {
-    ...options.state,
-    recoveryCodeHashes: recoveryCodes.map((code) => hashRecoveryCode(code)),
-    verifiedAt: now.toISOString(),
-  };
-
-  return {
-    state,
-    recoveryCodes,
-  };
-}
+}): TotpEnrollmentActivation {}
 
 export function verifyEnrollmentChallenge(options: {
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] LogicalOperator
auth/src/mfa/totp.ts:218:15
   now?: Date;
   recoveryCodeCount?: number;
 }): TotpEnrollmentActivation {
-  const now = options.now ?? new Date();
+  const now = options.now && new Date();
   const secret = resolveSecret(options.state, options.secretStore);
 
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Invalid TOTP code.

[Killed] ConditionalExpression
auth/src/mfa/totp.ts:221:7
   const now = options.now ?? new Date();
   const secret = resolveSecret(options.state, options.secretStore);
 
-  if (!verifyTotpCode(secret, options.code, now)) {
+  if (true) {
     throw new Error("Invalid TOTP code.");
   }
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Invalid TOTP code.

[Killed] BooleanLiteral
auth/src/mfa/totp.ts:221:7
   const now = options.now ?? new Date();
   const secret = resolveSecret(options.state, options.secretStore);
 
-  if (!verifyTotpCode(secret, options.code, now)) {
+  if (verifyTotpCode(secret, options.code, now)) {
     throw new Error("Invalid TOTP code.");
   }
killedBy: TOTP enrollment activates MFA and issues recovery codes
statusReason: Invalid TOTP code.

[NoCoverage] StringLiteral
auth/src/mfa/totp.ts:222:21
   const secret = resolveSecret(options.state, options.secretStore);
 
   if (!verifyTotpCode(secret, options.code, now)) {
-    throw new Error("Invalid TOTP code.");
+    throw new Error("");
   }
 

[Survived] LogicalOperator
auth/src/mfa/totp.ts:225:47
     throw new Error("Invalid TOTP code.");
   }
 
-  const recoveryCodes = generateRecoveryCodes(options.recoveryCodeCount ?? 10);
+  const recoveryCodes = generateRecoveryCodes(options.recoveryCodeCount && 10);
   const state: TotpEnrollmentState = {
     ...options.state,

[Survived] ArrowFunction
auth/src/mfa/totp.ts:228:43
   const recoveryCodes = generateRecoveryCodes(options.recoveryCodeCount ?? 10);
   const state: TotpEnrollmentState = {
     ...options.state,
-    recoveryCodeHashes: recoveryCodes.map((code) => hashRecoveryCode(code)),
+    recoveryCodeHashes: recoveryCodes.map(() => undefined),
     verifiedAt: now.toISOString(),
   };

[Killed] ObjectLiteral
auth/src/mfa/totp.ts:232:10
     verifiedAt: now.toISOString(),
   };
 
-  return {
-    state,
-    recoveryCodes,
-  };
+  return {};
 }
 
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Cannot read properties of undefined (reading 'recoveryCodeHashes')

[Killed] BlockStatement
auth/src/mfa/totp.ts:243:13
   code: string;
   secretStore: TotpSecretStore;
   now?: Date;
-}): boolean {
-  const secret = resolveSecret(options.state, options.secretStore);
-
-  return verifyTotpCode(secret, options.code, options.now ?? new Date());
-}
+}): boolean {}
 
 export function consumeRecoveryCode(
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: expected 'mfa_required' to be 'success' // Object.is equality

[Killed] LogicalOperator
auth/src/mfa/totp.ts:246:47
 }): boolean {
   const secret = resolveSecret(options.state, options.secretStore);
 
-  return verifyTotpCode(secret, options.code, options.now ?? new Date());
+  return verifyTotpCode(secret, options.code, options.now && new Date());
 }
 
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: expected 'mfa_required' to be 'success' // Object.is equality

[NoCoverage] BlockStatement
auth/src/mfa/totp.ts:252:31
 export function consumeRecoveryCode(
   state: TotpEnrollmentState,
   recoveryCode: string,
-): TotpEnrollmentState | null {
-  const codeHash = hashRecoveryCode(recoveryCode);
-  const recoveryCodeIndex = state.recoveryCodeHashes.findIndex(
-    (candidate) => candidate === codeHash,
-  );
-
-  if (recoveryCodeIndex < 0) {
-    return null;
-  }
-
-  return {
-    ...state,
-    recoveryCodeHashes: state.recoveryCodeHashes.filter(
-      (_, index) => index !== recoveryCodeIndex,
-    ),
-  };
-}
+): TotpEnrollmentState | null {}
 

[NoCoverage] ConditionalExpression
auth/src/mfa/totp.ts:255:20
 ): TotpEnrollmentState | null {
   const codeHash = hashRecoveryCode(recoveryCode);
   const recoveryCodeIndex = state.recoveryCodeHashes.findIndex(
-    (candidate) => candidate === codeHash,
+    (candidate) => false,
   );
 

[NoCoverage] ArrowFunction
auth/src/mfa/totp.ts:255:5
 ): TotpEnrollmentState | null {
   const codeHash = hashRecoveryCode(recoveryCode);
   const recoveryCodeIndex = state.recoveryCodeHashes.findIndex(
-    (candidate) => candidate === codeHash,
+    () => undefined,
   );
 

[NoCoverage] EqualityOperator
auth/src/mfa/totp.ts:258:7
     (candidate) => candidate === codeHash,
   );
 
-  if (recoveryCodeIndex < 0) {
+  if (recoveryCodeIndex <= 0) {
     return null;
   }

[NoCoverage] BlockStatement
auth/src/mfa/totp.ts:258:30
     (candidate) => candidate === codeHash,
   );
 
-  if (recoveryCodeIndex < 0) {
-    return null;
-  }
+  if (recoveryCodeIndex < 0) {}
 
   return {

[NoCoverage] MethodExpression
auth/src/mfa/totp.ts:264:25
 
   return {
     ...state,
-    recoveryCodeHashes: state.recoveryCodeHashes.filter(
-      (_, index) => index !== recoveryCodeIndex,
-    ),
+    recoveryCodeHashes: state.recoveryCodeHashes,
   };
 }

[NoCoverage] EqualityOperator
auth/src/mfa/totp.ts:265:21
   return {
     ...state,
     recoveryCodeHashes: state.recoveryCodeHashes.filter(
-      (_, index) => index !== recoveryCodeIndex,
+      (_, index) => index === recoveryCodeIndex,
     ),
   };

[NoCoverage] ArrowFunction
auth/src/mfa/totp.ts:265:7
   return {
     ...state,
     recoveryCodeHashes: state.recoveryCodeHashes.filter(
-      (_, index) => index !== recoveryCodeIndex,
+      () => undefined,
     ),
   };
