[Killed] EqualityOperator
auth/src/policy/password-policy.ts:17:7
 ): string[] {
   const violations: string[] = [];
 
-  if (password.length < policy.minLength) {
+  if (password.length >= policy.minLength) {
     violations.push(
       `Password must be at least ${policy.minLength} characters.`,
killedBy: InMemoryUserDirectory authenticates emails case-insensitively and trims whitespace
statusReason: Password must be at least 12 characters.

[Killed] BlockStatement
auth/src/policy/password-policy.ts:17:43
 ): string[] {
   const violations: string[] = [];
 
-  if (password.length < policy.minLength) {
-    violations.push(
-      `Password must be at least ${policy.minLength} characters.`,
-    );
-  }
+  if (password.length < policy.minLength) {}
 
   if (policy.requireUppercase && !/[A-Z]/.test(password)) {
killedBy: password policy returns all violations for an invalid password
statusReason: expected [ …(3) ] to have a length of 4 but got 3

[Survived] StringLiteral
auth/src/policy/password-policy.ts:19:7
 
   if (password.length < policy.minLength) {
     violations.push(
-      `Password must be at least ${policy.minLength} characters.`,
+      ``,
     );
   }

[Killed] BlockStatement
auth/src/policy/password-policy.ts:23:59
     );
   }
 
-  if (policy.requireUppercase && !/[A-Z]/.test(password)) {
-    violations.push("Password must include an uppercase letter.");
-  }
+  if (policy.requireUppercase && !/[A-Z]/.test(password)) {}
 
   if (policy.requireLowercase && !/[a-z]/.test(password)) {
killedBy: password policy rejects weak passwords
statusReason: expected [Function] to throw error matching /uppercase/i but got 'Password must be at least 12 characte…'

[Killed] BooleanLiteral
auth/src/policy/password-policy.ts:23:34
     );
   }
 
-  if (policy.requireUppercase && !/[A-Z]/.test(password)) {
+  if (policy.requireUppercase && /[A-Z]/.test(password)) {
     violations.push("Password must include an uppercase letter.");
   }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Password must include an uppercase letter.

[Killed] LogicalOperator
auth/src/policy/password-policy.ts:27:7
     violations.push("Password must include an uppercase letter.");
   }
 
-  if (policy.requireLowercase && !/[a-z]/.test(password)) {
+  if (policy.requireLowercase || !/[a-z]/.test(password)) {
     violations.push("Password must include a lowercase letter.");
   }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Password must include a lowercase letter.

[Killed] ConditionalExpression
auth/src/policy/password-policy.ts:27:7
     violations.push("Password must include an uppercase letter.");
   }
 
-  if (policy.requireLowercase && !/[a-z]/.test(password)) {
+  if (true) {
     violations.push("Password must include a lowercase letter.");
   }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Password must include a lowercase letter.

[NoCoverage] StringLiteral
auth/src/policy/password-policy.ts:28:21
   }
 
   if (policy.requireLowercase && !/[a-z]/.test(password)) {
-    violations.push("Password must include a lowercase letter.");
+    violations.push("");
   }
 

[Killed] BlockStatement
auth/src/policy/password-policy.ts:31:56
     violations.push("Password must include a lowercase letter.");
   }
 
-  if (policy.requireNumber && !/[0-9]/.test(password)) {
-    violations.push("Password must include a number.");
-  }
+  if (policy.requireNumber && !/[0-9]/.test(password)) {}
 
   if (policy.requireSpecialCharacter && !/[^A-Za-z0-9]/.test(password)) {
killedBy: password policy returns all violations for an invalid password
statusReason: expected [ …(3) ] to have a length of 4 but got 3

[Killed] ConditionalExpression
auth/src/policy/password-policy.ts:31:7
     violations.push("Password must include a lowercase letter.");
   }
 
-  if (policy.requireNumber && !/[0-9]/.test(password)) {
+  if (true) {
     violations.push("Password must include a number.");
   }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Password must include a number.

[Survived] StringLiteral
auth/src/policy/password-policy.ts:32:21
   }
 
   if (policy.requireNumber && !/[0-9]/.test(password)) {
-    violations.push("Password must include a number.");
+    violations.push("");
   }
 

[Killed] BlockStatement
auth/src/policy/password-policy.ts:35:73
     violations.push("Password must include a number.");
   }
 
-  if (policy.requireSpecialCharacter && !/[^A-Za-z0-9]/.test(password)) {
-    violations.push("Password must include a special character.");
-  }
+  if (policy.requireSpecialCharacter && !/[^A-Za-z0-9]/.test(password)) {}
 
   return violations;
killedBy: password policy returns all violations for an invalid password
statusReason: expected [ …(3) ] to have a length of 4 but got 3

[Killed] LogicalOperator
auth/src/policy/password-policy.ts:35:7
     violations.push("Password must include a number.");
   }
 
-  if (policy.requireSpecialCharacter && !/[^A-Za-z0-9]/.test(password)) {
+  if (policy.requireSpecialCharacter || !/[^A-Za-z0-9]/.test(password)) {
     violations.push("Password must include a special character.");
   }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Password must include a special character.

[Killed] BlockStatement
auth/src/policy/password-policy.ts:45:9
 export function assertPasswordPolicy(
   password: string,
   policy: PasswordPolicy = DEFAULT_PASSWORD_POLICY,
-): void {
-  const violations = validatePasswordAgainstPolicy(password, policy);
-
-  if (violations.length > 0) {
-    throw new Error(violations.join(" "));
-  }
-}
+): void {}
 
killedBy: AuthService rejects weak password updates
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
auth/src/policy/password-policy.ts:48:7
 ): void {
   const violations = validatePasswordAgainstPolicy(password, policy);
 
-  if (violations.length > 0) {
+  if (violations.length <= 0) {
     throw new Error(violations.join(" "));
   }
killedBy: AuthService creates a local session for a seeded synthetic user

[Killed] EqualityOperator
auth/src/policy/password-policy.ts:48:7
 ): void {
   const violations = validatePasswordAgainstPolicy(password, policy);
 
-  if (violations.length > 0) {
+  if (violations.length >= 0) {
     throw new Error(violations.join(" "));
   }
killedBy: AuthService creates a local session for a seeded synthetic user
