[Killed] BlockStatement
auth/src/service/auth-service.ts:46:54
   readonly #totpSecretStore: TotpSecretStore;
   readonly #auditSink: AuthAuditSink;
 
-  constructor(dependencies: AuthServiceDependencies) {
-    this.#config = dependencies.config ?? getLocalAuthConfig();
-    this.#sessionStore = dependencies.sessionStore;
-    this.#userDirectory =
-      dependencies.userDirectory ??
-      new InMemoryUserDirectory(createSyntheticLocalAccounts(this.#config));
-    this.#totpSecretStore =
-      dependencies.totpSecretStore ?? createInMemoryTotpSecretStore();
-    this.#auditSink = dependencies.auditSink ?? noopAuditSink;
-  }
+  constructor(dependencies: AuthServiceDependencies) {}
 
   async #recordAuditEvent(event: AuthAuditEvent): Promise<void> {
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'authenticatePrimaryFactor')

[Killed] LogicalOperator
auth/src/service/auth-service.ts:47:20
   readonly #auditSink: AuthAuditSink;
 
   constructor(dependencies: AuthServiceDependencies) {
-    this.#config = dependencies.config ?? getLocalAuthConfig();
+    this.#config = dependencies.config && getLocalAuthConfig();
     this.#sessionStore = dependencies.sessionStore;
     this.#userDirectory =
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'sessionPolicy')

[Survived] LogicalOperator
auth/src/service/auth-service.ts:50:7
     this.#config = dependencies.config ?? getLocalAuthConfig();
     this.#sessionStore = dependencies.sessionStore;
     this.#userDirectory =
-      dependencies.userDirectory ??
-      new InMemoryUserDirectory(createSyntheticLocalAccounts(this.#config));
+      dependencies.userDirectory && new InMemoryUserDirectory(createSyntheticLocalAccounts(this.#config));
     this.#totpSecretStore =
       dependencies.totpSecretStore ?? createInMemoryTotpSecretStore();

[Killed] LogicalOperator
auth/src/service/auth-service.ts:53:7
       dependencies.userDirectory ??
       new InMemoryUserDirectory(createSyntheticLocalAccounts(this.#config));
     this.#totpSecretStore =
-      dependencies.totpSecretStore ?? createInMemoryTotpSecretStore();
+      dependencies.totpSecretStore && createInMemoryTotpSecretStore();
     this.#auditSink = dependencies.auditSink ?? noopAuditSink;
   }
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Cannot read properties of undefined (reading 'saveSecret')

[Killed] LogicalOperator
auth/src/service/auth-service.ts:54:23
       new InMemoryUserDirectory(createSyntheticLocalAccounts(this.#config));
     this.#totpSecretStore =
       dependencies.totpSecretStore ?? createInMemoryTotpSecretStore();
-    this.#auditSink = dependencies.auditSink ?? noopAuditSink;
+    this.#auditSink = dependencies.auditSink && noopAuditSink;
   }
 
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'record')

[Killed] BlockStatement
auth/src/service/auth-service.ts:57:65
     this.#auditSink = dependencies.auditSink ?? noopAuditSink;
   }
 
-  async #recordAuditEvent(event: AuthAuditEvent): Promise<void> {
-    await this.#auditSink.record(event);
-  }
+  async #recordAuditEvent(event: AuthAuditEvent): Promise<void> {}
 
   get config(): LocalAuthConfig {
killedBy: AuthService emits audit events for failed and successful authentication
statusReason: expected [] to include 'auth.login.failed'

[NoCoverage] BlockStatement
auth/src/service/auth-service.ts:61:33
     await this.#auditSink.record(event);
   }
 
-  get config(): LocalAuthConfig {
-    return {
-      ...this.#config,
-      sessionPolicy: {
-        ...this.#config.sessionPolicy,
-      },
-    };
-  }
+  get config(): LocalAuthConfig {}
 
   listUsers(): AuthenticatedUser[] {

[NoCoverage] ObjectLiteral
auth/src/service/auth-service.ts:62:12
   }
 
   get config(): LocalAuthConfig {
-    return {
-      ...this.#config,
-      sessionPolicy: {
-        ...this.#config.sessionPolicy,
-      },
-    };
+    return {};
   }
 

[NoCoverage] BlockStatement
auth/src/service/auth-service.ts:70:36
     };
   }
 
-  listUsers(): AuthenticatedUser[] {
-    return this.#userDirectory.listUsers();
-  }
+  listUsers(): AuthenticatedUser[] {}
 
   createUser(input: CreateLocalUserInput): AuthenticatedUser {

[NoCoverage] BlockStatement
auth/src/service/auth-service.ts:74:62
     return this.#userDirectory.listUsers();
   }
 
-  createUser(input: CreateLocalUserInput): AuthenticatedUser {
-    return this.#userDirectory.createUser(input);
-  }
+  createUser(input: CreateLocalUserInput): AuthenticatedUser {}
 
   async login(input: LoginInput): Promise<LoginResult> {

[Killed] BlockStatement
auth/src/service/auth-service.ts:85:45
       this.#config.sessionPolicy.maxFailedAttempts,
     );
 
-    if (primaryResult.status !== "success") {
-      await this.#recordAuditEvent({
-        type: "auth.login.failed",
-        occurredAt: (input.now ?? new Date()).toISOString(),
-        email: input.email.trim().toLowerCase(),
-        ...(input.ipAddress === undefined
-          ? {}
-          : { ipAddress: input.ipAddress }),
-        ...(input.userAgent === undefined
-          ? {}
-          : { userAgent: input.userAgent }),
-        reason: primaryResult.status,
-      });
-      return primaryResult;
-    }
+    if (primaryResult.status !== "success") {}
 
     const account = this.#userDirectory.getAccount(primaryResult.user.userId);
killedBy: AuthService locks a user after five failed attempts and allows an admin reset
statusReason: Cannot read properties of undefined (reading 'userId')

[Killed] ConditionalExpression
auth/src/service/auth-service.ts:85:9
       this.#config.sessionPolicy.maxFailedAttempts,
     );
 
-    if (primaryResult.status !== "success") {
+    if (false) {
       await this.#recordAuditEvent({
         type: "auth.login.failed",
killedBy: AuthService locks a user after five failed attempts and allows an admin reset
statusReason: Cannot read properties of undefined (reading 'userId')

[Killed] LogicalOperator
auth/src/service/auth-service.ts:88:22
     if (primaryResult.status !== "success") {
       await this.#recordAuditEvent({
         type: "auth.login.failed",
-        occurredAt: (input.now ?? new Date()).toISOString(),
+        occurredAt: (input.now && new Date()).toISOString(),
         email: input.email.trim().toLowerCase(),
         ...(input.ipAddress === undefined
killedBy: AuthService locks a user after five failed attempts and allows an admin reset
statusReason: Cannot read properties of undefined (reading 'toISOString')

[Survived] MethodExpression
auth/src/service/auth-service.ts:89:16
       await this.#recordAuditEvent({
         type: "auth.login.failed",
         occurredAt: (input.now ?? new Date()).toISOString(),
-        email: input.email.trim().toLowerCase(),
+        email: input.email.trim().toUpperCase(),
         ...(input.ipAddress === undefined
           ? {}

[Survived] MethodExpression
auth/src/service/auth-service.ts:89:16
       await this.#recordAuditEvent({
         type: "auth.login.failed",
         occurredAt: (input.now ?? new Date()).toISOString(),
-        email: input.email.trim().toLowerCase(),
+        email: input.email.toLowerCase(),
         ...(input.ipAddress === undefined
           ? {}

[Survived] ConditionalExpression
auth/src/service/auth-service.ts:90:13
         type: "auth.login.failed",
         occurredAt: (input.now ?? new Date()).toISOString(),
         email: input.email.trim().toLowerCase(),
-        ...(input.ipAddress === undefined
+        ...(true
           ? {}
           : { ipAddress: input.ipAddress }),

[Survived] ConditionalExpression
auth/src/service/auth-service.ts:90:13
         type: "auth.login.failed",
         occurredAt: (input.now ?? new Date()).toISOString(),
         email: input.email.trim().toLowerCase(),
-        ...(input.ipAddress === undefined
+        ...(false
           ? {}
           : { ipAddress: input.ipAddress }),

[Survived] ConditionalExpression
auth/src/service/auth-service.ts:93:13
         ...(input.ipAddress === undefined
           ? {}
           : { ipAddress: input.ipAddress }),
-        ...(input.userAgent === undefined
+        ...(true
           ? {}
           : { userAgent: input.userAgent }),

[Survived] EqualityOperator
auth/src/service/auth-service.ts:93:13
         ...(input.ipAddress === undefined
           ? {}
           : { ipAddress: input.ipAddress }),
-        ...(input.userAgent === undefined
+        ...(input.userAgent !== undefined
           ? {}
           : { userAgent: input.userAgent }),

[Killed] ConditionalExpression
auth/src/service/auth-service.ts:103:9
 
     const account = this.#userDirectory.getAccount(primaryResult.user.userId);
 
-    if (account === undefined) {
+    if (true) {
       throw new Error(`Unknown userId: ${primaryResult.user.userId}`);
     }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Unknown userId: usr-apa

[Killed] EqualityOperator
auth/src/service/auth-service.ts:103:9
 
     const account = this.#userDirectory.getAccount(primaryResult.user.userId);
 
-    if (account === undefined) {
+    if (account !== undefined) {
       throw new Error(`Unknown userId: ${primaryResult.user.userId}`);
     }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Unknown userId: usr-apa

[Killed] ConditionalExpression
auth/src/service/auth-service.ts:107:9
       throw new Error(`Unknown userId: ${primaryResult.user.userId}`);
     }
 
-    if (account.mfaEnabled) {
+    if (false) {
       const mfaEnrollment = account.mfaEnrollment;
 
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: expected 'success' to be 'mfa_required' // Object.is equality

[Killed] ConditionalExpression
auth/src/service/auth-service.ts:107:9
       throw new Error(`Unknown userId: ${primaryResult.user.userId}`);
     }
 
-    if (account.mfaEnabled) {
+    if (true) {
       const mfaEnrollment = account.mfaEnrollment;
 
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Missing MFA enrollment for userId: usr-apa

[Killed] EqualityOperator
auth/src/service/auth-service.ts:110:11
     if (account.mfaEnabled) {
       const mfaEnrollment = account.mfaEnrollment;
 
-      if (mfaEnrollment === undefined) {
+      if (mfaEnrollment !== undefined) {
         throw new Error(`Missing MFA enrollment for userId: ${account.userId}`);
       }
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Missing MFA enrollment for userId: usr-apa

[Killed] ConditionalExpression
auth/src/service/auth-service.ts:110:11
     if (account.mfaEnabled) {
       const mfaEnrollment = account.mfaEnrollment;
 
-      if (mfaEnrollment === undefined) {
+      if (true) {
         throw new Error(`Missing MFA enrollment for userId: ${account.userId}`);
       }
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Missing MFA enrollment for userId: usr-apa

[Killed] EqualityOperator
auth/src/service/auth-service.ts:114:11
         throw new Error(`Missing MFA enrollment for userId: ${account.userId}`);
       }
 
-      if (input.recoveryCode !== undefined) {
+      if (input.recoveryCode === undefined) {
         const updatedEnrollment = consumeRecoveryCode(
           mfaEnrollment,
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Cannot read properties of undefined (reading 'replaceAll')

[Killed] ConditionalExpression
auth/src/service/auth-service.ts:114:11
         throw new Error(`Missing MFA enrollment for userId: ${account.userId}`);
       }
 
-      if (input.recoveryCode !== undefined) {
+      if (true) {
         const updatedEnrollment = consumeRecoveryCode(
           mfaEnrollment,
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Cannot read properties of undefined (reading 'replaceAll')

[NoCoverage] ConditionalExpression
auth/src/service/auth-service.ts:120:13
           input.recoveryCode,
         );
 
-        if (updatedEnrollment === null) {
+        if (false) {
           await this.#recordAuditEvent({
             type: "auth.login.failed",

[NoCoverage] ConditionalExpression
auth/src/service/auth-service.ts:120:13
           input.recoveryCode,
         );
 
-        if (updatedEnrollment === null) {
+        if (true) {
           await this.#recordAuditEvent({
             type: "auth.login.failed",

[NoCoverage] ObjectLiteral
auth/src/service/auth-service.ts:129:18
             email: account.email,
             reason: "invalid_recovery_code",
           });
-          return { status: "invalid_credentials" };
+          return {};
         }
 

[NoCoverage] StringLiteral
auth/src/service/auth-service.ts:129:28
             email: account.email,
             reason: "invalid_recovery_code",
           });
-          return { status: "invalid_credentials" };
+          return { status: "" };
         }
 

[Killed] ConditionalExpression
auth/src/service/auth-service.ts:134:9
 
         this.#userDirectory.setMfaEnrollment(account.userId, updatedEnrollment);
       } else if (
-        input.totpCode === undefined ||
-        !verifyEnrollmentChallenge({
-          state: mfaEnrollment,
-          code: input.totpCode,
-          secretStore: this.#totpSecretStore,
-          ...(input.now === undefined ? {} : { now: input.now }),
-        })
+        false
       ) {
         await this.#recordAuditEvent({
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: expected 'success' to be 'mfa_required' // Object.is equality

[Killed] ConditionalExpression
auth/src/service/auth-service.ts:134:9
 
         this.#userDirectory.setMfaEnrollment(account.userId, updatedEnrollment);
       } else if (
-        input.totpCode === undefined ||
+        false ||
         !verifyEnrollmentChallenge({
           state: mfaEnrollment,
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] BooleanLiteral
auth/src/service/auth-service.ts:135:9
         this.#userDirectory.setMfaEnrollment(account.userId, updatedEnrollment);
       } else if (
         input.totpCode === undefined ||
-        !verifyEnrollmentChallenge({
-          state: mfaEnrollment,
-          code: input.totpCode,
-          secretStore: this.#totpSecretStore,
-          ...(input.now === undefined ? {} : { now: input.now }),
-        })
+        verifyEnrollmentChallenge({
+  state: mfaEnrollment,
+  code: input.totpCode,
+  secretStore: this.#totpSecretStore,
+  ...(input.now === undefined ? {} : {
+    now: input.now
+  })
+})
       ) {
         await this.#recordAuditEvent({
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: expected 'mfa_required' to be 'success' // Object.is equality

[Killed] ConditionalExpression
auth/src/service/auth-service.ts:139:15
           state: mfaEnrollment,
           code: input.totpCode,
           secretStore: this.#totpSecretStore,
-          ...(input.now === undefined ? {} : { now: input.now }),
+          ...(true ? {} : { now: input.now }),
         })
       ) {
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: expected 'mfa_required' to be 'success' // Object.is equality

[Killed] EqualityOperator
auth/src/service/auth-service.ts:139:15
           state: mfaEnrollment,
           code: input.totpCode,
           secretStore: this.#totpSecretStore,
-          ...(input.now === undefined ? {} : { now: input.now }),
+          ...(input.now !== undefined ? {} : { now: input.now }),
         })
       ) {
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: expected 'mfa_required' to be 'success' // Object.is equality

[Killed] BlockStatement
auth/src/service/auth-service.ts:141:9
           secretStore: this.#totpSecretStore,
           ...(input.now === undefined ? {} : { now: input.now }),
         })
-      ) {
-        await this.#recordAuditEvent({
-          type: "auth.login.mfa_required",
-          occurredAt: (input.now ?? new Date()).toISOString(),
-          userId: account.userId,
-          tenantId: account.tenantId,
-          email: account.email,
-          ...(input.ipAddress === undefined
-            ? {}
-            : { ipAddress: input.ipAddress }),
-          ...(input.userAgent === undefined
-            ? {}
-            : { userAgent: input.userAgent }),
-        });
-        return { status: "mfa_required", user: primaryResult.user };
-      }
+      ) {}
     }
 
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: expected 'success' to be 'mfa_required' // Object.is equality

[Survived] ObjectLiteral
auth/src/service/auth-service.ts:142:38
           ...(input.now === undefined ? {} : { now: input.now }),
         })
       ) {
-        await this.#recordAuditEvent({
-          type: "auth.login.mfa_required",
-          occurredAt: (input.now ?? new Date()).toISOString(),
-          userId: account.userId,
-          tenantId: account.tenantId,
-          email: account.email,
-          ...(input.ipAddress === undefined
-            ? {}
-            : { ipAddress: input.ipAddress }),
-          ...(input.userAgent === undefined
-            ? {}
-            : { userAgent: input.userAgent }),
-        });
+        await this.#recordAuditEvent({});
         return { status: "mfa_required", user: primaryResult.user };
       }

[Survived] StringLiteral
auth/src/service/auth-service.ts:143:17
         })
       ) {
         await this.#recordAuditEvent({
-          type: "auth.login.mfa_required",
+          type: "",
           occurredAt: (input.now ?? new Date()).toISOString(),
           userId: account.userId,

[Survived] LogicalOperator
auth/src/service/auth-service.ts:144:24
       ) {
         await this.#recordAuditEvent({
           type: "auth.login.mfa_required",
-          occurredAt: (input.now ?? new Date()).toISOString(),
+          occurredAt: (input.now && new Date()).toISOString(),
           userId: account.userId,
           tenantId: account.tenantId,

[Survived] ConditionalExpression
auth/src/service/auth-service.ts:148:15
           userId: account.userId,
           tenantId: account.tenantId,
           email: account.email,
-          ...(input.ipAddress === undefined
+          ...(true
             ? {}
             : { ipAddress: input.ipAddress }),

[Survived] ConditionalExpression
auth/src/service/auth-service.ts:148:15
           userId: account.userId,
           tenantId: account.tenantId,
           email: account.email,
-          ...(input.ipAddress === undefined
+          ...(false
             ? {}
             : { ipAddress: input.ipAddress }),

[Survived] ConditionalExpression
auth/src/service/auth-service.ts:151:15
           ...(input.ipAddress === undefined
             ? {}
             : { ipAddress: input.ipAddress }),
-          ...(input.userAgent === undefined
+          ...(false
             ? {}
             : { userAgent: input.userAgent }),

[NoCoverage] ObjectLiteral
auth/src/service/auth-service.ts:153:15
             : { ipAddress: input.ipAddress }),
           ...(input.userAgent === undefined
             ? {}
-            : { userAgent: input.userAgent }),
+            : {}),
         });
         return { status: "mfa_required", user: primaryResult.user };

[Killed] StringLiteral
auth/src/service/auth-service.ts:155:26
             ? {}
             : { userAgent: input.userAgent }),
         });
-        return { status: "mfa_required", user: primaryResult.user };
+        return { status: "", user: primaryResult.user };
       }
     }
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: expected '' to be 'mfa_required' // Object.is equality

[Killed] ObjectLiteral
auth/src/service/auth-service.ts:155:16
             ? {}
             : { userAgent: input.userAgent }),
         });
-        return { status: "mfa_required", user: primaryResult.user };
+        return {};
       }
     }
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: expected undefined to be 'mfa_required' // Object.is equality

[Killed] ObjectLiteral
auth/src/service/auth-service.ts:160:7
     }
 
     const session = await this.#sessionStore.createSession(
-      {
-        userId: primaryResult.user.userId,
-        tenantId: primaryResult.user.tenantId,
-        roleIds: primaryResult.user.roleIds,
-      },
+      {},
       {
         ...(input.ipAddress === undefined
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: principal.roleIds is not iterable

[Survived] ObjectLiteral
auth/src/service/auth-service.ts:165:7
         tenantId: primaryResult.user.tenantId,
         roleIds: primaryResult.user.roleIds,
       },
-      {
-        ...(input.ipAddress === undefined
-          ? {}
-          : { ipAddress: input.ipAddress }),
-        ...(input.userAgent === undefined
-          ? {}
-          : { userAgent: input.userAgent }),
-      },
+      {},
       input.now,
     );

[Survived] ConditionalExpression
auth/src/service/auth-service.ts:166:13
         roleIds: primaryResult.user.roleIds,
       },
       {
-        ...(input.ipAddress === undefined
+        ...(true
           ? {}
           : { ipAddress: input.ipAddress }),

[Survived] EqualityOperator
auth/src/service/auth-service.ts:166:13
         roleIds: primaryResult.user.roleIds,
       },
       {
-        ...(input.ipAddress === undefined
+        ...(input.ipAddress !== undefined
           ? {}
           : { ipAddress: input.ipAddress }),

[NoCoverage] ObjectLiteral
auth/src/service/auth-service.ts:168:13
       {
         ...(input.ipAddress === undefined
           ? {}
-          : { ipAddress: input.ipAddress }),
+          : {}),
         ...(input.userAgent === undefined
           ? {}

[Killed] LogicalOperator
auth/src/service/auth-service.ts:178:20
 
     await this.#recordAuditEvent({
       type: "auth.login.succeeded",
-      occurredAt: (input.now ?? new Date()).toISOString(),
+      occurredAt: (input.now && new Date()).toISOString(),
       userId: primaryResult.user.userId,
       tenantId: primaryResult.user.tenantId,
killedBy: AuthService locks a user after five failed attempts and allows an admin reset
statusReason: Cannot read properties of undefined (reading 'toISOString')

[Survived] ConditionalExpression
auth/src/service/auth-service.ts:183:11
       tenantId: primaryResult.user.tenantId,
       email: primaryResult.user.email,
       sessionId: session.sessionId,
-      ...(input.ipAddress === undefined ? {} : { ipAddress: input.ipAddress }),
+      ...(true ? {} : { ipAddress: input.ipAddress }),
       ...(input.userAgent === undefined ? {} : { userAgent: input.userAgent }),
     });

[Survived] EqualityOperator
auth/src/service/auth-service.ts:183:11
       tenantId: primaryResult.user.tenantId,
       email: primaryResult.user.email,
       sessionId: session.sessionId,
-      ...(input.ipAddress === undefined ? {} : { ipAddress: input.ipAddress }),
+      ...(input.ipAddress !== undefined ? {} : { ipAddress: input.ipAddress }),
       ...(input.userAgent === undefined ? {} : { userAgent: input.userAgent }),
     });

[Survived] ConditionalExpression
auth/src/service/auth-service.ts:184:11
       email: primaryResult.user.email,
       sessionId: session.sessionId,
       ...(input.ipAddress === undefined ? {} : { ipAddress: input.ipAddress }),
-      ...(input.userAgent === undefined ? {} : { userAgent: input.userAgent }),
+      ...(true ? {} : { userAgent: input.userAgent }),
     });
 

[Survived] EqualityOperator
auth/src/service/auth-service.ts:184:11
       email: primaryResult.user.email,
       sessionId: session.sessionId,
       ...(input.ipAddress === undefined ? {} : { ipAddress: input.ipAddress }),
-      ...(input.userAgent === undefined ? {} : { userAgent: input.userAgent }),
+      ...(input.userAgent !== undefined ? {} : { userAgent: input.userAgent }),
     });
 

[Killed] StringLiteral
auth/src/service/auth-service.ts:188:15
     });
 
     return {
-      status: "success",
+      status: "",
       user: primaryResult.user,
       session,
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: expected '' to be 'success' // Object.is equality

[NoCoverage] BlockStatement
auth/src/service/auth-service.ts:197:34
   async getSession(
     sessionToken: string,
     now?: Date,
-  ): Promise<AuthSession | null> {
-    return this.#sessionStore.getSession(sessionToken, now);
-  }
+  ): Promise<AuthSession | null> {}
 
   async touchSession(

[NoCoverage] BlockStatement
auth/src/service/auth-service.ts:204:34
   async touchSession(
     sessionToken: string,
     now?: Date,
-  ): Promise<AuthSession | null> {
-    return this.#sessionStore.touchSession(sessionToken, now);
-  }
+  ): Promise<AuthSession | null> {}
 
   async invalidateSession(sessionToken: string): Promise<void> {

[NoCoverage] BlockStatement
auth/src/service/auth-service.ts:208:64
     return this.#sessionStore.touchSession(sessionToken, now);
   }
 
-  async invalidateSession(sessionToken: string): Promise<void> {
-    await this.#sessionStore.invalidateSession(sessionToken);
-    await this.#recordAuditEvent({
-      type: "auth.session.invalidated",
-      occurredAt: new Date().toISOString(),
-      reason: "manual_invalidation",
-    });
-  }
+  async invalidateSession(sessionToken: string): Promise<void> {}
 
   startTotpEnrollment(

[NoCoverage] ObjectLiteral
auth/src/service/auth-service.ts:210:34
 
   async invalidateSession(sessionToken: string): Promise<void> {
     await this.#sessionStore.invalidateSession(sessionToken);
-    await this.#recordAuditEvent({
-      type: "auth.session.invalidated",
-      occurredAt: new Date().toISOString(),
-      reason: "manual_invalidation",
-    });
+    await this.#recordAuditEvent({});
   }
 

[Killed] EqualityOperator
auth/src/service/auth-service.ts:228:9
       throw new Error(`Unknown userId: ${userId}`);
     }
 
-    if (account.mfaEnrollment !== undefined) {
+    if (account.mfaEnrollment === undefined) {
       this.#totpSecretStore.deleteSecret(account.mfaEnrollment.secretRef);
     }
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Cannot read properties of undefined (reading 'secretRef')

[Killed] ConditionalExpression
auth/src/service/auth-service.ts:228:9
       throw new Error(`Unknown userId: ${userId}`);
     }
 
-    if (account.mfaEnrollment !== undefined) {
+    if (true) {
       this.#totpSecretStore.deleteSecret(account.mfaEnrollment.secretRef);
     }
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Cannot read properties of undefined (reading 'secretRef')

[Killed] ObjectLiteral
auth/src/service/auth-service.ts:232:44
       this.#totpSecretStore.deleteSecret(account.mfaEnrollment.secretRef);
     }
 
-    const enrollment = startTotpEnrollment({
-      userId,
-      issuer: this.#config.issuer,
-      accountName: accountName ?? account.email,
-      secretStore: this.#totpSecretStore,
-      ...(now === undefined ? {} : { now }),
-    });
+    const enrollment = startTotpEnrollment({});
 
     this.#userDirectory.setMfaEnrollment(userId, enrollment.state);
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Cannot read properties of undefined (reading 'saveSecret')

[Survived] LogicalOperator
auth/src/service/auth-service.ts:235:20
     const enrollment = startTotpEnrollment({
       userId,
       issuer: this.#config.issuer,
-      accountName: accountName ?? account.email,
+      accountName: accountName && account.email,
       secretStore: this.#totpSecretStore,
       ...(now === undefined ? {} : { now }),

[Survived] ConditionalExpression
auth/src/service/auth-service.ts:237:11
       issuer: this.#config.issuer,
       accountName: accountName ?? account.email,
       secretStore: this.#totpSecretStore,
-      ...(now === undefined ? {} : { now }),
+      ...(false ? {} : { now }),
     });
 

[Survived] EqualityOperator
auth/src/service/auth-service.ts:237:11
       issuer: this.#config.issuer,
       accountName: accountName ?? account.email,
       secretStore: this.#totpSecretStore,
-      ...(now === undefined ? {} : { now }),
+      ...(now !== undefined ? {} : { now }),
     });
 

[Survived] StringLiteral
auth/src/service/auth-service.ts:242:13
 
     this.#userDirectory.setMfaEnrollment(userId, enrollment.state);
     void this.#recordAuditEvent({
-      type: "auth.mfa.enrollment.started",
+      type: "",
       occurredAt: (now ?? new Date()).toISOString(),
       userId: account.userId,

[Survived] LogicalOperator
auth/src/service/auth-service.ts:243:20
     this.#userDirectory.setMfaEnrollment(userId, enrollment.state);
     void this.#recordAuditEvent({
       type: "auth.mfa.enrollment.started",
-      occurredAt: (now ?? new Date()).toISOString(),
+      occurredAt: (now && new Date()).toISOString(),
       userId: account.userId,
       tenantId: account.tenantId,
