[Killed] BlockStatement
auth/src/service/auth-service.ts:255:31
     userId: string,
     code: string,
     now?: Date,
-  ): TotpEnrollmentActivation {
-    const account = this.#userDirectory.getAccount(userId);
-
-    if (account?.mfaEnrollment === undefined) {
-      throw new Error(`No active MFA enrollment for userId: ${userId}`);
-    }
-
-    const activation = activateTotpEnrollment({
-      state: account.mfaEnrollment,
-      code,
-      secretStore: this.#totpSecretStore,
-      ...(now === undefined ? {} : { now }),
-    });
-
-    this.#userDirectory.setMfaEnrollment(userId, activation.state);
-    void this.#recordAuditEvent({
-      type: "auth.mfa.enrollment.activated",
-      occurredAt: (now ?? new Date()).toISOString(),
-      userId: account.userId,
-      tenantId: account.tenantId,
-      email: account.email,
-    });
-    return activation;
-  }
+  ): TotpEnrollmentActivation {}
 
   async resetMfa(userId: string): Promise<void> {
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: expected 'success' to be 'mfa_required' // Object.is equality

[Killed] ConditionalExpression
auth/src/service/auth-service.ts:258:9
   ): TotpEnrollmentActivation {
     const account = this.#userDirectory.getAccount(userId);
 
-    if (account?.mfaEnrollment === undefined) {
+    if (true) {
       throw new Error(`No active MFA enrollment for userId: ${userId}`);
     }
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: No active MFA enrollment for userId: usr-apa

[Killed] EqualityOperator
auth/src/service/auth-service.ts:258:9
   ): TotpEnrollmentActivation {
     const account = this.#userDirectory.getAccount(userId);
 
-    if (account?.mfaEnrollment === undefined) {
+    if (account?.mfaEnrollment !== undefined) {
       throw new Error(`No active MFA enrollment for userId: ${userId}`);
     }
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: No active MFA enrollment for userId: usr-apa

[NoCoverage] StringLiteral
auth/src/service/auth-service.ts:259:23
     const account = this.#userDirectory.getAccount(userId);
 
     if (account?.mfaEnrollment === undefined) {
-      throw new Error(`No active MFA enrollment for userId: ${userId}`);
+      throw new Error(``);
     }
 

[Killed] ObjectLiteral
auth/src/service/auth-service.ts:262:47
       throw new Error(`No active MFA enrollment for userId: ${userId}`);
     }
 
-    const activation = activateTotpEnrollment({
-      state: account.mfaEnrollment,
-      code,
-      secretStore: this.#totpSecretStore,
-      ...(now === undefined ? {} : { now }),
-    });
+    const activation = activateTotpEnrollment({});
 
     this.#userDirectory.setMfaEnrollment(userId, activation.state);
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Cannot read properties of undefined (reading 'getSecret')

[Killed] ConditionalExpression
auth/src/service/auth-service.ts:266:11
       state: account.mfaEnrollment,
       code,
       secretStore: this.#totpSecretStore,
-      ...(now === undefined ? {} : { now }),
+      ...(true ? {} : { now }),
     });
 
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Invalid TOTP code.

[Survived] LogicalOperator
auth/src/service/auth-service.ts:272:20
     this.#userDirectory.setMfaEnrollment(userId, activation.state);
     void this.#recordAuditEvent({
       type: "auth.mfa.enrollment.activated",
-      occurredAt: (now ?? new Date()).toISOString(),
+      occurredAt: (now && new Date()).toISOString(),
       userId: account.userId,
       tenantId: account.tenantId,

[NoCoverage] BlockStatement
auth/src/service/auth-service.ts:280:49
     return activation;
   }
 
-  async resetMfa(userId: string): Promise<void> {
-    const account = this.#userDirectory.getAccount(userId);
-
-    if (account?.mfaEnrollment !== undefined) {
-      this.#totpSecretStore.deleteSecret(account.mfaEnrollment.secretRef);
-    }
-
-    this.#userDirectory.resetMfa(userId);
-    await this.#sessionStore.invalidateUserSessions(userId);
-    await this.#recordAuditEvent({
-      type: "auth.mfa.reset",
-      occurredAt: new Date().toISOString(),
-      ...(account?.userId === undefined ? {} : { userId: account.userId }),
-      ...(account?.tenantId === undefined
-        ? {}
-        : { tenantId: account.tenantId }),
-      ...(account?.email === undefined ? {} : { email: account.email }),
-    });
-  }
+  async resetMfa(userId: string): Promise<void> {}
 
   resetLockout(userId: string): void {

[NoCoverage] EqualityOperator
auth/src/service/auth-service.ts:283:9
   async resetMfa(userId: string): Promise<void> {
     const account = this.#userDirectory.getAccount(userId);
 
-    if (account?.mfaEnrollment !== undefined) {
+    if (account?.mfaEnrollment === undefined) {
       this.#totpSecretStore.deleteSecret(account.mfaEnrollment.secretRef);
     }

[NoCoverage] BlockStatement
auth/src/service/auth-service.ts:283:47
   async resetMfa(userId: string): Promise<void> {
     const account = this.#userDirectory.getAccount(userId);
 
-    if (account?.mfaEnrollment !== undefined) {
-      this.#totpSecretStore.deleteSecret(account.mfaEnrollment.secretRef);
-    }
+    if (account?.mfaEnrollment !== undefined) {}
 
     this.#userDirectory.resetMfa(userId);

[NoCoverage] ObjectLiteral
auth/src/service/auth-service.ts:289:34
 
     this.#userDirectory.resetMfa(userId);
     await this.#sessionStore.invalidateUserSessions(userId);
-    await this.#recordAuditEvent({
-      type: "auth.mfa.reset",
-      occurredAt: new Date().toISOString(),
-      ...(account?.userId === undefined ? {} : { userId: account.userId }),
-      ...(account?.tenantId === undefined
-        ? {}
-        : { tenantId: account.tenantId }),
-      ...(account?.email === undefined ? {} : { email: account.email }),
-    });
+    await this.#recordAuditEvent({});
   }
 

[NoCoverage] ConditionalExpression
auth/src/service/auth-service.ts:292:11
     await this.#recordAuditEvent({
       type: "auth.mfa.reset",
       occurredAt: new Date().toISOString(),
-      ...(account?.userId === undefined ? {} : { userId: account.userId }),
+      ...(false ? {} : { userId: account.userId }),
       ...(account?.tenantId === undefined
         ? {}

[NoCoverage] ConditionalExpression
auth/src/service/auth-service.ts:292:11
     await this.#recordAuditEvent({
       type: "auth.mfa.reset",
       occurredAt: new Date().toISOString(),
-      ...(account?.userId === undefined ? {} : { userId: account.userId }),
+      ...(true ? {} : { userId: account.userId }),
       ...(account?.tenantId === undefined
         ? {}

[NoCoverage] OptionalChaining
auth/src/service/auth-service.ts:293:11
       type: "auth.mfa.reset",
       occurredAt: new Date().toISOString(),
       ...(account?.userId === undefined ? {} : { userId: account.userId }),
-      ...(account?.tenantId === undefined
+      ...(account.tenantId === undefined
         ? {}
         : { tenantId: account.tenantId }),

[NoCoverage] ConditionalExpression
auth/src/service/auth-service.ts:293:11
       type: "auth.mfa.reset",
       occurredAt: new Date().toISOString(),
       ...(account?.userId === undefined ? {} : { userId: account.userId }),
-      ...(account?.tenantId === undefined
+      ...(false
         ? {}
         : { tenantId: account.tenantId }),

[NoCoverage] EqualityOperator
auth/src/service/auth-service.ts:296:11
       ...(account?.tenantId === undefined
         ? {}
         : { tenantId: account.tenantId }),
-      ...(account?.email === undefined ? {} : { email: account.email }),
+      ...(account?.email !== undefined ? {} : { email: account.email }),
     });
   }

[NoCoverage] OptionalChaining
auth/src/service/auth-service.ts:296:11
       ...(account?.tenantId === undefined
         ? {}
         : { tenantId: account.tenantId }),
-      ...(account?.email === undefined ? {} : { email: account.email }),
+      ...(account.email === undefined ? {} : { email: account.email }),
     });
   }

[Killed] BlockStatement
auth/src/service/auth-service.ts:300:38
     });
   }
 
-  resetLockout(userId: string): void {
-    this.#userDirectory.resetLockout(userId);
-    void this.#recordAuditEvent({
-      type: "auth.lockout.reset",
-      occurredAt: new Date().toISOString(),
-      userId,
-    });
-  }
+  resetLockout(userId: string): void {}
 
   async deactivateUser(userId: string): Promise<void> {
killedBy: AuthService locks a user after five failed attempts and allows an admin reset
statusReason: expected 'account_locked' to be 'success' // Object.is equality

[Survived] StringLiteral
auth/src/service/auth-service.ts:303:13
   resetLockout(userId: string): void {
     this.#userDirectory.resetLockout(userId);
     void this.#recordAuditEvent({
-      type: "auth.lockout.reset",
+      type: "",
       occurredAt: new Date().toISOString(),
       userId,

[NoCoverage] BlockStatement
auth/src/service/auth-service.ts:309:55
     });
   }
 
-  async deactivateUser(userId: string): Promise<void> {
-    const account = this.#userDirectory.getAccount(userId);
-    this.#userDirectory.deactivateUser(userId);
-    await this.#sessionStore.invalidateUserSessions(userId);
-    await this.#recordAuditEvent({
-      type: "auth.account.deactivated",
-      occurredAt: new Date().toISOString(),
-      ...(account?.userId === undefined ? {} : { userId: account.userId }),
-      ...(account?.tenantId === undefined
-        ? {}
-        : { tenantId: account.tenantId }),
-      ...(account?.email === undefined ? {} : { email: account.email }),
-    });
-  }
+  async deactivateUser(userId: string): Promise<void> {}
 
   async updatePassword(userId: string, nextPassword: string): Promise<void> {

[NoCoverage] ObjectLiteral
auth/src/service/auth-service.ts:313:34
     const account = this.#userDirectory.getAccount(userId);
     this.#userDirectory.deactivateUser(userId);
     await this.#sessionStore.invalidateUserSessions(userId);
-    await this.#recordAuditEvent({
-      type: "auth.account.deactivated",
-      occurredAt: new Date().toISOString(),
-      ...(account?.userId === undefined ? {} : { userId: account.userId }),
-      ...(account?.tenantId === undefined
-        ? {}
-        : { tenantId: account.tenantId }),
-      ...(account?.email === undefined ? {} : { email: account.email }),
-    });
+    await this.#recordAuditEvent({});
   }
 

[NoCoverage] StringLiteral
auth/src/service/auth-service.ts:314:13
     this.#userDirectory.deactivateUser(userId);
     await this.#sessionStore.invalidateUserSessions(userId);
     await this.#recordAuditEvent({
-      type: "auth.account.deactivated",
+      type: "",
       occurredAt: new Date().toISOString(),
       ...(account?.userId === undefined ? {} : { userId: account.userId }),

[NoCoverage] EqualityOperator
auth/src/service/auth-service.ts:316:11
     await this.#recordAuditEvent({
       type: "auth.account.deactivated",
       occurredAt: new Date().toISOString(),
-      ...(account?.userId === undefined ? {} : { userId: account.userId }),
+      ...(account?.userId !== undefined ? {} : { userId: account.userId }),
       ...(account?.tenantId === undefined
         ? {}

[NoCoverage] EqualityOperator
auth/src/service/auth-service.ts:317:11
       type: "auth.account.deactivated",
       occurredAt: new Date().toISOString(),
       ...(account?.userId === undefined ? {} : { userId: account.userId }),
-      ...(account?.tenantId === undefined
+      ...(account?.tenantId !== undefined
         ? {}
         : { tenantId: account.tenantId }),

[NoCoverage] ObjectLiteral
auth/src/service/auth-service.ts:319:11
       ...(account?.userId === undefined ? {} : { userId: account.userId }),
       ...(account?.tenantId === undefined
         ? {}
-        : { tenantId: account.tenantId }),
+        : {}),
       ...(account?.email === undefined ? {} : { email: account.email }),
     });

[NoCoverage] ConditionalExpression
auth/src/service/auth-service.ts:320:11
       ...(account?.tenantId === undefined
         ? {}
         : { tenantId: account.tenantId }),
-      ...(account?.email === undefined ? {} : { email: account.email }),
+      ...(true ? {} : { email: account.email }),
     });
   }

[Killed] BlockStatement
auth/src/service/auth-service.ts:324:77
     });
   }
 
-  async updatePassword(userId: string, nextPassword: string): Promise<void> {
-    const account = this.#userDirectory.getAccount(userId);
-    this.#userDirectory.updatePassword(userId, nextPassword);
-    await this.#sessionStore.invalidateUserSessions(userId);
-    await this.#recordAuditEvent({
-      type: "auth.password.updated",
-      occurredAt: new Date().toISOString(),
-      ...(account?.userId === undefined ? {} : { userId: account.userId }),
-      ...(account?.tenantId === undefined
-        ? {}
-        : { tenantId: account.tenantId }),
-      ...(account?.email === undefined ? {} : { email: account.email }),
-    });
-  }
+  async updatePassword(userId: string, nextPassword: string): Promise<void> {}
 }
 
killedBy: AuthService rejects weak password updates
statusReason: promise resolved "undefined" instead of rejecting

[NoCoverage] OptionalChaining
auth/src/service/auth-service.ts:331:11
     await this.#recordAuditEvent({
       type: "auth.password.updated",
       occurredAt: new Date().toISOString(),
-      ...(account?.userId === undefined ? {} : { userId: account.userId }),
+      ...(account.userId === undefined ? {} : { userId: account.userId }),
       ...(account?.tenantId === undefined
         ? {}

[NoCoverage] ConditionalExpression
auth/src/service/auth-service.ts:332:11
       type: "auth.password.updated",
       occurredAt: new Date().toISOString(),
       ...(account?.userId === undefined ? {} : { userId: account.userId }),
-      ...(account?.tenantId === undefined
+      ...(true
         ? {}
         : { tenantId: account.tenantId }),

[NoCoverage] BlockStatement
auth/src/service/auth-service.ts:343:16
 export function createDefaultAuthService(
   sessionStore: SessionStore,
   config: LocalAuthConfig = getLocalAuthConfig(),
-): AuthService {
-  return new AuthService({
-    config: {
-      ...config,
-      sessionPolicy: {
-        ...DEFAULT_SESSION_POLICY,
-        ...config.sessionPolicy,
-      },
-    },
-    sessionStore,
-  });
-}
+): AuthService {}
 

[NoCoverage] ObjectLiteral
auth/src/service/auth-service.ts:344:26
   sessionStore: SessionStore,
   config: LocalAuthConfig = getLocalAuthConfig(),
 ): AuthService {
-  return new AuthService({
-    config: {
-      ...config,
-      sessionPolicy: {
-        ...DEFAULT_SESSION_POLICY,
-        ...config.sessionPolicy,
-      },
-    },
-    sessionStore,
-  });
+  return new AuthService({});
 }
 
