[Killed] BlockStatement
auth/src/session/memory-session-store.ts:19:38
   readonly #sessions = new Map<string, AuthSession>();
   readonly #tokensByUserId = new Map<string, Set<string>>();
 
-  constructor(policy: SessionPolicy) {
-    this.#policy = policy;
-  }
+  constructor(policy: SessionPolicy) {}
 
   createSession(
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'absoluteTimeoutHours')

[Killed] BlockStatement
auth/src/session/memory-session-store.ts:27:27
     principal: SessionPrincipal,
     metadata: SessionMetadata = {},
     now: Date = new Date(),
-  ): Promise<AuthSession> {
-    const session = buildSessionRecord(principal, this.#policy, metadata, now);
-    this.#sessions.set(session.sessionToken, session);
-
-    const tokens =
-      this.#tokensByUserId.get(session.userId) ?? new Set<string>();
-    tokens.add(session.sessionToken);
-    this.#tokensByUserId.set(session.userId, tokens);
-
-    return Promise.resolve({
-      ...session,
-      roleIds: [...session.roleIds],
-    });
-  }
+  ): Promise<AuthSession> {}
 
   async getSession(
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'sessionId')

[Killed] LogicalOperator
auth/src/session/memory-session-store.ts:32:7
     this.#sessions.set(session.sessionToken, session);
 
     const tokens =
-      this.#tokensByUserId.get(session.userId) ?? new Set<string>();
+      this.#tokensByUserId.get(session.userId) && new Set<string>();
     tokens.add(session.sessionToken);
     this.#tokensByUserId.set(session.userId, tokens);
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'add')

[NoCoverage] BlockStatement
auth/src/session/memory-session-store.ts:45:34
   async getSession(
     sessionToken: string,
     now: Date = new Date(),
-  ): Promise<AuthSession | null> {
-    const session = this.#sessions.get(sessionToken);
-
-    if (session === undefined) {
-      return null;
-    }
-
-    if (getSessionTtlSeconds(session, now) === null) {
-      await this.invalidateSession(sessionToken);
-      return null;
-    }
-
-    return {
-      ...session,
-      roleIds: [...session.roleIds],
-    };
-  }
+  ): Promise<AuthSession | null> {}
 
   async touchSession(

[NoCoverage] ConditionalExpression
auth/src/session/memory-session-store.ts:48:9
   ): Promise<AuthSession | null> {
     const session = this.#sessions.get(sessionToken);
 
-    if (session === undefined) {
+    if (true) {
       return null;
     }

[NoCoverage] BlockStatement
auth/src/session/memory-session-store.ts:48:32
   ): Promise<AuthSession | null> {
     const session = this.#sessions.get(sessionToken);
 
-    if (session === undefined) {
-      return null;
-    }
+    if (session === undefined) {}
 
     if (getSessionTtlSeconds(session, now) === null) {

[NoCoverage] EqualityOperator
auth/src/session/memory-session-store.ts:52:9
       return null;
     }
 
-    if (getSessionTtlSeconds(session, now) === null) {
+    if (getSessionTtlSeconds(session, now) !== null) {
       await this.invalidateSession(sessionToken);
       return null;

[NoCoverage] ConditionalExpression
auth/src/session/memory-session-store.ts:52:9
       return null;
     }
 
-    if (getSessionTtlSeconds(session, now) === null) {
+    if (true) {
       await this.invalidateSession(sessionToken);
       return null;

[NoCoverage] ObjectLiteral
auth/src/session/memory-session-store.ts:57:12
       return null;
     }
 
-    return {
-      ...session,
-      roleIds: [...session.roleIds],
-    };
+    return {};
   }
 

[NoCoverage] BlockStatement
auth/src/session/memory-session-store.ts:66:34
   async touchSession(
     sessionToken: string,
     now: Date = new Date(),
-  ): Promise<AuthSession | null> {
-    const session = await this.getSession(sessionToken, now);
-
-    if (session === null) {
-      return null;
-    }
-
-    const refreshedSession = refreshSession(session, this.#policy, now);
-
-    if (refreshedSession === null) {
-      await this.invalidateSession(sessionToken);
-      return null;
-    }
-
-    this.#sessions.set(sessionToken, refreshedSession);
-
-    return {
-      ...refreshedSession,
-      roleIds: [...refreshedSession.roleIds],
-    };
-  }
+  ): Promise<AuthSession | null> {}
 
   invalidateSession(sessionToken: string): Promise<void> {

[NoCoverage] BlockStatement
auth/src/session/memory-session-store.ts:69:27
   ): Promise<AuthSession | null> {
     const session = await this.getSession(sessionToken, now);
 
-    if (session === null) {
-      return null;
-    }
+    if (session === null) {}
 
     const refreshedSession = refreshSession(session, this.#policy, now);

[NoCoverage] ConditionalExpression
auth/src/session/memory-session-store.ts:69:9
   ): Promise<AuthSession | null> {
     const session = await this.getSession(sessionToken, now);
 
-    if (session === null) {
+    if (false) {
       return null;
     }

[NoCoverage] EqualityOperator
auth/src/session/memory-session-store.ts:75:9
 
     const refreshedSession = refreshSession(session, this.#policy, now);
 
-    if (refreshedSession === null) {
+    if (refreshedSession !== null) {
       await this.invalidateSession(sessionToken);
       return null;

[NoCoverage] BlockStatement
auth/src/session/memory-session-store.ts:75:36
 
     const refreshedSession = refreshSession(session, this.#policy, now);
 
-    if (refreshedSession === null) {
-      await this.invalidateSession(sessionToken);
-      return null;
-    }
+    if (refreshedSession === null) {}
 
     this.#sessions.set(sessionToken, refreshedSession);

[NoCoverage] BlockStatement
auth/src/session/memory-session-store.ts:88:58
     };
   }
 
-  invalidateSession(sessionToken: string): Promise<void> {
-    const session = this.#sessions.get(sessionToken);
-
-    if (session === undefined) {
-      return Promise.resolve();
-    }
-
-    this.#sessions.delete(sessionToken);
-    const tokens = this.#tokensByUserId.get(session.userId);
-
-    if (tokens === undefined) {
-      return Promise.resolve();
-    }
-
-    tokens.delete(sessionToken);
-
-    if (tokens.size === 0) {
-      this.#tokensByUserId.delete(session.userId);
-    }
-
-    return Promise.resolve();
-  }
+  invalidateSession(sessionToken: string): Promise<void> {}
 
   invalidateUserSessions(userId: string): Promise<number> {

[NoCoverage] EqualityOperator
auth/src/session/memory-session-store.ts:91:9
   invalidateSession(sessionToken: string): Promise<void> {
     const session = this.#sessions.get(sessionToken);
 
-    if (session === undefined) {
+    if (session !== undefined) {
       return Promise.resolve();
     }

[NoCoverage] ConditionalExpression
auth/src/session/memory-session-store.ts:91:9
   invalidateSession(sessionToken: string): Promise<void> {
     const session = this.#sessions.get(sessionToken);
 
-    if (session === undefined) {
+    if (false) {
       return Promise.resolve();
     }

[NoCoverage] ConditionalExpression
auth/src/session/memory-session-store.ts:98:9
     this.#sessions.delete(sessionToken);
     const tokens = this.#tokensByUserId.get(session.userId);
 
-    if (tokens === undefined) {
+    if (false) {
       return Promise.resolve();
     }

[NoCoverage] ConditionalExpression
auth/src/session/memory-session-store.ts:98:9
     this.#sessions.delete(sessionToken);
     const tokens = this.#tokensByUserId.get(session.userId);
 
-    if (tokens === undefined) {
+    if (true) {
       return Promise.resolve();
     }

[NoCoverage] EqualityOperator
auth/src/session/memory-session-store.ts:104:9
 
     tokens.delete(sessionToken);
 
-    if (tokens.size === 0) {
+    if (tokens.size !== 0) {
       this.#tokensByUserId.delete(session.userId);
     }

[NoCoverage] BlockStatement
auth/src/session/memory-session-store.ts:104:28
 
     tokens.delete(sessionToken);
 
-    if (tokens.size === 0) {
-      this.#tokensByUserId.delete(session.userId);
-    }
+    if (tokens.size === 0) {}
 
     return Promise.resolve();

[NoCoverage] BlockStatement
auth/src/session/memory-session-store.ts:111:59
     return Promise.resolve();
   }
 
-  invalidateUserSessions(userId: string): Promise<number> {
-    const tokens = this.#tokensByUserId.get(userId);
-
-    if (tokens === undefined) {
-      return Promise.resolve(0);
-    }
-
-    const count = tokens.size;
-
-    for (const token of tokens) {
-      this.#sessions.delete(token);
-    }
-
-    this.#tokensByUserId.delete(userId);
-    return Promise.resolve(count);
-  }
+  invalidateUserSessions(userId: string): Promise<number> {}
 }
 

[NoCoverage] BlockStatement
auth/src/session/memory-session-store.ts:114:31
   invalidateUserSessions(userId: string): Promise<number> {
     const tokens = this.#tokensByUserId.get(userId);
 
-    if (tokens === undefined) {
-      return Promise.resolve(0);
-    }
+    if (tokens === undefined) {}
 
     const count = tokens.size;

[NoCoverage] BlockStatement
auth/src/session/memory-session-store.ts:120:33
 
     const count = tokens.size;
 
-    for (const token of tokens) {
-      this.#sessions.delete(token);
-    }
+    for (const token of tokens) {}
 
     this.#tokensByUserId.delete(userId);
