[Killed] BlockStatement
auth/src/session/redis-session-store.ts:40:5
     client: RedisSessionClient,
     policy: SessionPolicy,
     options: RedisSessionStoreOptions = {},
-  ) {
-    this.#client = client;
-    this.#policy = policy;
-    this.#keyPrefix = options.keyPrefix ?? "casemind:auth";
-  }
+  ) {}
 
   #sessionKey(sessionToken: string): string {
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: Cannot read properties of undefined (reading 'absoluteTimeoutHours')

[Survived] LogicalOperator
auth/src/session/redis-session-store.ts:43:23
   ) {
     this.#client = client;
     this.#policy = policy;
-    this.#keyPrefix = options.keyPrefix ?? "casemind:auth";
+    this.#keyPrefix = options.keyPrefix && "casemind:auth";
   }
 

[Killed] BlockStatement
auth/src/session/redis-session-store.ts:46:45
     this.#keyPrefix = options.keyPrefix ?? "casemind:auth";
   }
 
-  #sessionKey(sessionToken: string): string {
-    return `${this.#keyPrefix}:session:${sessionToken}`;
-  }
+  #sessionKey(sessionToken: string): string {}
 
   #userIndexKey(userId: string): string {
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: "arguments[1]" must be of type "string | Buffer", got undefined instead.

[Killed] BlockStatement
auth/src/session/redis-session-store.ts:50:41
     return `${this.#keyPrefix}:session:${sessionToken}`;
   }
 
-  #userIndexKey(userId: string): string {
-    return `${this.#keyPrefix}:user:${userId}:sessions`;
-  }
+  #userIndexKey(userId: string): string {}
 
   async #writeSession(session: AuthSession, now: Date): Promise<void> {
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: "arguments[1]" must be of type "string | Buffer", got undefined instead.

[Killed] BlockStatement
auth/src/session/redis-session-store.ts:54:71
     return `${this.#keyPrefix}:user:${userId}:sessions`;
   }
 
-  async #writeSession(session: AuthSession, now: Date): Promise<void> {
-    const ttlSeconds = getSessionTtlSeconds(session, now);
-
-    if (ttlSeconds === null) {
-      throw new Error("Cannot persist an expired session.");
-    }
-
-    await this.#client.set(
-      this.#sessionKey(session.sessionToken),
-      JSON.stringify(session),
-      { EX: ttlSeconds },
-    );
-    await this.#client.sAdd(
-      this.#userIndexKey(session.userId),
-      session.sessionToken,
-    );
-    await this.#client.expire(
-      this.#userIndexKey(session.userId),
-      Math.max(ttlSeconds, this.#policy.absoluteTimeoutHours * 3600),
-    );
-  }
+  async #writeSession(session: AuthSession, now: Date): Promise<void> {}
 
   async #readSession(sessionToken: string): Promise<AuthSession | null> {
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: expected undefined to be 'usr-apa' // Object.is equality

[Killed] ConditionalExpression
auth/src/session/redis-session-store.ts:57:9
   async #writeSession(session: AuthSession, now: Date): Promise<void> {
     const ttlSeconds = getSessionTtlSeconds(session, now);
 
-    if (ttlSeconds === null) {
+    if (true) {
       throw new Error("Cannot persist an expired session.");
     }
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: Cannot persist an expired session.

[Killed] EqualityOperator
auth/src/session/redis-session-store.ts:57:9
   async #writeSession(session: AuthSession, now: Date): Promise<void> {
     const ttlSeconds = getSessionTtlSeconds(session, now);
 
-    if (ttlSeconds === null) {
+    if (ttlSeconds !== null) {
       throw new Error("Cannot persist an expired session.");
     }
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: Cannot persist an expired session.

[Survived] MethodExpression
auth/src/session/redis-session-store.ts:72:7
     );
     await this.#client.expire(
       this.#userIndexKey(session.userId),
-      Math.max(ttlSeconds, this.#policy.absoluteTimeoutHours * 3600),
+      Math.min(ttlSeconds, this.#policy.absoluteTimeoutHours * 3600),
     );
   }

[Survived] ArithmeticOperator
auth/src/session/redis-session-store.ts:72:28
     );
     await this.#client.expire(
       this.#userIndexKey(session.userId),
-      Math.max(ttlSeconds, this.#policy.absoluteTimeoutHours * 3600),
+      Math.max(ttlSeconds, this.#policy.absoluteTimeoutHours / 3600),
     );
   }

[Killed] BlockStatement
auth/src/session/redis-session-store.ts:76:73
     );
   }
 
-  async #readSession(sessionToken: string): Promise<AuthSession | null> {
-    const payload = await this.#client.get(this.#sessionKey(sessionToken));
-
-    if (payload === null) {
-      return null;
-    }
-
-    return JSON.parse(payload) as AuthSession;
-  }
+  async #readSession(sessionToken: string): Promise<AuthSession | null> {}
 
   async createSession(
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: Cannot read properties of undefined (reading 'idleExpiresAt')

[Killed] EqualityOperator
auth/src/session/redis-session-store.ts:79:9
   async #readSession(sessionToken: string): Promise<AuthSession | null> {
     const payload = await this.#client.get(this.#sessionKey(sessionToken));
 
-    if (payload === null) {
+    if (payload !== null) {
       return null;
     }
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: expected undefined to be 'usr-apa' // Object.is equality

[Killed] ConditionalExpression
auth/src/session/redis-session-store.ts:79:9
   async #readSession(sessionToken: string): Promise<AuthSession | null> {
     const payload = await this.#client.get(this.#sessionKey(sessionToken));
 
-    if (payload === null) {
+    if (true) {
       return null;
     }
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: expected undefined to be 'usr-apa' // Object.is equality

[Killed] BlockStatement
auth/src/session/redis-session-store.ts:90:27
     principal: SessionPrincipal,
     metadata: SessionMetadata = {},
     now: Date = new Date(),
-  ): Promise<AuthSession> {
-    const session = buildSessionRecord(principal, this.#policy, metadata, now);
-    await this.#writeSession(session, now);
-
-    return {
-      ...session,
-      roleIds: [...session.roleIds],
-    };
-  }
+  ): Promise<AuthSession> {}
 
   async getSession(
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: Cannot read properties of undefined (reading 'sessionToken')

[Survived] ArrayDeclaration
auth/src/session/redis-session-store.ts:96:16
 
     return {
       ...session,
-      roleIds: [...session.roleIds],
+      roleIds: [],
     };
   }

[Killed] BlockStatement
auth/src/session/redis-session-store.ts:103:34
   async getSession(
     sessionToken: string,
     now: Date = new Date(),
-  ): Promise<AuthSession | null> {
-    const session = await this.#readSession(sessionToken);
-
-    if (session === null) {
-      return null;
-    }
-
-    if (getSessionTtlSeconds(session, now) === null) {
-      await this.invalidateSession(sessionToken);
-      return null;
-    }
-
-    return {
-      ...session,
-      roleIds: [...session.roleIds],
-    };
-  }
+  ): Promise<AuthSession | null> {}
 
   async touchSession(
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: Cannot read properties of undefined (reading 'idleExpiresAt')

[Killed] BlockStatement
auth/src/session/redis-session-store.ts:124:34
   async touchSession(
     sessionToken: string,
     now: Date = new Date(),
-  ): Promise<AuthSession | null> {
-    const session = await this.getSession(sessionToken, now);
-
-    if (session === null) {
-      return null;
-    }
-
-    const refreshedSession = refreshSession(session, this.#policy, now);
-
-    if (refreshedSession === null) {
-      await this.invalidateSession(sessionToken);
-      return null;
-    }
-
-    await this.#writeSession(refreshedSession, now);
-
-    return {
-      ...refreshedSession,
-      roleIds: [...refreshedSession.roleIds],
-    };
-  }
+  ): Promise<AuthSession | null> {}
 
   async invalidateSession(sessionToken: string): Promise<void> {
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: expected undefined to be '2026-03-10T12:10:00.000Z' // Object.is equality

[Killed] EqualityOperator
auth/src/session/redis-session-store.ts:127:9
   ): Promise<AuthSession | null> {
     const session = await this.getSession(sessionToken, now);
 
-    if (session === null) {
+    if (session !== null) {
       return null;
     }
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: expected undefined to be '2026-03-10T12:10:00.000Z' // Object.is equality

[Killed] ConditionalExpression
auth/src/session/redis-session-store.ts:127:9
   ): Promise<AuthSession | null> {
     const session = await this.getSession(sessionToken, now);
 
-    if (session === null) {
+    if (true) {
       return null;
     }
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: expected undefined to be '2026-03-10T12:10:00.000Z' // Object.is equality

[Killed] ConditionalExpression
auth/src/session/redis-session-store.ts:133:9
 
     const refreshedSession = refreshSession(session, this.#policy, now);
 
-    if (refreshedSession === null) {
+    if (true) {
       await this.invalidateSession(sessionToken);
       return null;
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: expected undefined to be '2026-03-10T12:10:00.000Z' // Object.is equality

[Survived] ArrayDeclaration
auth/src/session/redis-session-store.ts:142:16
 
     return {
       ...refreshedSession,
-      roleIds: [...refreshedSession.roleIds],
+      roleIds: [],
     };
   }

[NoCoverage] BlockStatement
auth/src/session/redis-session-store.ts:146:64
     };
   }
 
-  async invalidateSession(sessionToken: string): Promise<void> {
-    const session = await this.#readSession(sessionToken);
-
-    if (session !== null) {
-      await this.#client.sRem(this.#userIndexKey(session.userId), sessionToken);
-    }
-
-    await this.#client.del(this.#sessionKey(sessionToken));
-  }
+  async invalidateSession(sessionToken: string): Promise<void> {}
 
   async invalidateUserSessions(userId: string): Promise<number> {

[NoCoverage] EqualityOperator
auth/src/session/redis-session-store.ts:149:9
   async invalidateSession(sessionToken: string): Promise<void> {
     const session = await this.#readSession(sessionToken);
 
-    if (session !== null) {
+    if (session === null) {
       await this.#client.sRem(this.#userIndexKey(session.userId), sessionToken);
     }

[NoCoverage] ConditionalExpression
auth/src/session/redis-session-store.ts:149:9
   async invalidateSession(sessionToken: string): Promise<void> {
     const session = await this.#readSession(sessionToken);
 
-    if (session !== null) {
+    if (false) {
       await this.#client.sRem(this.#userIndexKey(session.userId), sessionToken);
     }

[Killed] BlockStatement
auth/src/session/redis-session-store.ts:156:65
     await this.#client.del(this.#sessionKey(sessionToken));
   }
 
-  async invalidateUserSessions(userId: string): Promise<number> {
-    const indexKey = this.#userIndexKey(userId);
-    const sessionTokens = await this.#client.sMembers(indexKey);
-
-    for (const sessionToken of sessionTokens) {
-      await this.#client.del(this.#sessionKey(sessionToken));
-    }
-
-    await this.#client.del(indexKey);
-    return sessionTokens.length;
-  }
+  async invalidateUserSessions(userId: string): Promise<number> {}
 
   async close(): Promise<void> {
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: expected { …(10) } to be null

[Killed] BlockStatement
auth/src/session/redis-session-store.ts:160:47
     const indexKey = this.#userIndexKey(userId);
     const sessionTokens = await this.#client.sMembers(indexKey);
 
-    for (const sessionToken of sessionTokens) {
-      await this.#client.del(this.#sessionKey(sessionToken));
-    }
+    for (const sessionToken of sessionTokens) {}
 
     await this.#client.del(indexKey);
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: expected { …(10) } to be null

[Survived] ConditionalExpression
auth/src/session/redis-session-store.ts:169:9
   }
 
   async close(): Promise<void> {
-    if (this.#client.quit !== undefined) {
+    if (true) {
       await this.#client.quit();
     }

[Killed] BlockStatement
auth/src/session/redis-session-store.ts:179:31
   url: string,
   policy: SessionPolicy,
   options: RedisSessionStoreOptions = {},
-): Promise<RedisSessionStore> {
-  const client = createClient({ url });
-  await client.connect();
-  return new RedisSessionStore(client, policy, options);
-}
+): Promise<RedisSessionStore> {}
 
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: Cannot read properties of undefined (reading 'createSession')
