[Killed] BlockStatement
auth/src/session/session-store.ts:32:16
   policy: SessionPolicy,
   metadata: SessionMetadata = {},
   now: Date = new Date(),
-): AuthSession {
-  const absoluteExpiresAt = computeAbsoluteExpiration(now, policy);
-  const idleExpiresAt = computeIdleExpiration(now, policy, absoluteExpiresAt);
-
-  return {
-    sessionId: randomUUID(),
-    sessionToken: randomBytes(32).toString("base64url"),
-    userId: principal.userId,
-    tenantId: principal.tenantId,
-    roleIds: [...principal.roleIds],
-    issuedAt: now.toISOString(),
-    lastActivityAt: now.toISOString(),
-    idleExpiresAt: idleExpiresAt.toISOString(),
-    absoluteExpiresAt: absoluteExpiresAt.toISOString(),
-    ...(metadata.ipAddress === undefined
-      ? {}
-      : { ipAddress: metadata.ipAddress }),
-    ...(metadata.userAgent === undefined
-      ? {}
-      : { userAgent: metadata.userAgent }),
-  };
-}
+): AuthSession {}
 
 export function getSessionTtlSeconds(
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'sessionToken')

[Survived] ConditionalExpression
auth/src/session/session-store.ts:46:9
     lastActivityAt: now.toISOString(),
     idleExpiresAt: idleExpiresAt.toISOString(),
     absoluteExpiresAt: absoluteExpiresAt.toISOString(),
-    ...(metadata.ipAddress === undefined
+    ...(true
       ? {}
       : { ipAddress: metadata.ipAddress }),

[Survived] EqualityOperator
auth/src/session/session-store.ts:46:9
     lastActivityAt: now.toISOString(),
     idleExpiresAt: idleExpiresAt.toISOString(),
     absoluteExpiresAt: absoluteExpiresAt.toISOString(),
-    ...(metadata.ipAddress === undefined
+    ...(metadata.ipAddress !== undefined
       ? {}
       : { ipAddress: metadata.ipAddress }),

[Survived] ConditionalExpression
auth/src/session/session-store.ts:49:9
     ...(metadata.ipAddress === undefined
       ? {}
       : { ipAddress: metadata.ipAddress }),
-    ...(metadata.userAgent === undefined
+    ...(false
       ? {}
       : { userAgent: metadata.userAgent }),

[Survived] EqualityOperator
auth/src/session/session-store.ts:49:9
     ...(metadata.ipAddress === undefined
       ? {}
       : { ipAddress: metadata.ipAddress }),
-    ...(metadata.userAgent === undefined
+    ...(metadata.userAgent !== undefined
       ? {}
       : { userAgent: metadata.userAgent }),

[Killed] BlockStatement
auth/src/session/session-store.ts:58:18
 export function getSessionTtlSeconds(
   session: AuthSession,
   now: Date = new Date(),
-): number | null {
-  if (isSessionExpired(session, now)) {
-    return null;
-  }
-
-  const idleExpiresAt = new Date(session.idleExpiresAt);
-
-  return Math.max(
-    1,
-    Math.ceil((idleExpiresAt.getTime() - now.getTime()) / 1000),
-  );
-}
+): number | null {}
 
 export function refreshSession(
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: ERR value is not an integer or out of range

[Killed] ConditionalExpression
auth/src/session/session-store.ts:59:7
   session: AuthSession,
   now: Date = new Date(),
 ): number | null {
-  if (isSessionExpired(session, now)) {
+  if (true) {
     return null;
   }
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: Cannot persist an expired session.

[NoCoverage] BlockStatement
auth/src/session/session-store.ts:59:39
   session: AuthSession,
   now: Date = new Date(),
 ): number | null {
-  if (isSessionExpired(session, now)) {
-    return null;
-  }
+  if (isSessionExpired(session, now)) {}
 
   const idleExpiresAt = new Date(session.idleExpiresAt);

[Survived] MethodExpression
auth/src/session/session-store.ts:65:10
 
   const idleExpiresAt = new Date(session.idleExpiresAt);
 
-  return Math.max(
-    1,
-    Math.ceil((idleExpiresAt.getTime() - now.getTime()) / 1000),
-  );
+  return Math.min(1, Math.ceil((idleExpiresAt.getTime() - now.getTime()) / 1000));
 }
 

[Survived] ArithmeticOperator
auth/src/session/session-store.ts:67:15
 
   return Math.max(
     1,
-    Math.ceil((idleExpiresAt.getTime() - now.getTime()) / 1000),
+    Math.ceil((idleExpiresAt.getTime() - now.getTime()) * 1000),
   );
 }

[Survived] ArithmeticOperator
auth/src/session/session-store.ts:67:16
 
   return Math.max(
     1,
-    Math.ceil((idleExpiresAt.getTime() - now.getTime()) / 1000),
+    Math.ceil((idleExpiresAt.getTime() + now.getTime()) / 1000),
   );
 }

[Killed] BlockStatement
auth/src/session/session-store.ts:75:23
   session: AuthSession,
   policy: SessionPolicy,
   now: Date = new Date(),
-): AuthSession | null {
-  if (isSessionExpired(session, now)) {
-    return null;
-  }
-
-  const absoluteExpiresAt = new Date(session.absoluteExpiresAt);
-  const idleExpiresAt = computeIdleExpiration(now, policy, absoluteExpiresAt);
-
-  return {
-    ...session,
-    roleIds: [...session.roleIds],
-    lastActivityAt: now.toISOString(),
-    idleExpiresAt: idleExpiresAt.toISOString(),
-  };
-}
+): AuthSession | null {}
 
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: Cannot read properties of undefined (reading 'idleExpiresAt')

[Killed] ConditionalExpression
auth/src/session/session-store.ts:76:7
   policy: SessionPolicy,
   now: Date = new Date(),
 ): AuthSession | null {
-  if (isSessionExpired(session, now)) {
+  if (true) {
     return null;
   }
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: expected undefined to be '2026-03-10T12:10:00.000Z' // Object.is equality

[Survived] ConditionalExpression
auth/src/session/session-store.ts:76:7
   policy: SessionPolicy,
   now: Date = new Date(),
 ): AuthSession | null {
-  if (isSessionExpired(session, now)) {
+  if (false) {
     return null;
   }

[Killed] ObjectLiteral
auth/src/session/session-store.ts:83:10
   const absoluteExpiresAt = new Date(session.absoluteExpiresAt);
   const idleExpiresAt = computeIdleExpiration(now, policy, absoluteExpiresAt);
 
-  return {
-    ...session,
-    roleIds: [...session.roleIds],
-    lastActivityAt: now.toISOString(),
-    idleExpiresAt: idleExpiresAt.toISOString(),
-  };
+  return {};
 }
 
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: ERR value is not an integer or out of range
