[Killed] BlockStatement
auth/src/users/in-memory-user-directory.ts:11:48
   TotpEnrollmentState,
 } from "../types.js";
 
-function normalizeEmail(email: string): string {
-  return email.trim().toLowerCase();
-}
+function normalizeEmail(email: string): string {}
 
 function toAuthenticatedUser(account: LocalUserAccount): AuthenticatedUser {
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Duplicate email detected: undefined

[Killed] MethodExpression
auth/src/users/in-memory-user-directory.ts:12:10
 } from "../types.js";
 
 function normalizeEmail(email: string): string {
-  return email.trim().toLowerCase();
+  return email.toLowerCase();
 }
 
killedBy: InMemoryUserDirectory authenticates emails case-insensitively and trims whitespace
statusReason: expected 'invalid_credentials' to be 'success' // Object.is equality

[Survived] MethodExpression
auth/src/users/in-memory-user-directory.ts:12:10
 } from "../types.js";
 
 function normalizeEmail(email: string): string {
-  return email.trim().toLowerCase();
+  return email.trim().toUpperCase();
 }
 

[Killed] BlockStatement
auth/src/users/in-memory-user-directory.ts:15:76
   return email.trim().toLowerCase();
 }
 
-function toAuthenticatedUser(account: LocalUserAccount): AuthenticatedUser {
-  return {
-    userId: account.userId,
-    tenantId: account.tenantId,
-    email: account.email,
-    displayName: account.displayName,
-    roleIds: [...account.roleIds],
-    mfaEnabled: account.mfaEnabled,
-    accountLocked: account.accountLocked,
-  };
-}
+function toAuthenticatedUser(account: LocalUserAccount): AuthenticatedUser {}
 
 export function createLocalUserAccount(
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'userId')

[Killed] ObjectLiteral
auth/src/users/in-memory-user-directory.ts:16:10
 }
 
 function toAuthenticatedUser(account: LocalUserAccount): AuthenticatedUser {
-  return {
-    userId: account.userId,
-    tenantId: account.tenantId,
-    email: account.email,
-    displayName: account.displayName,
-    roleIds: [...account.roleIds],
-    mfaEnabled: account.mfaEnabled,
-    accountLocked: account.accountLocked,
-  };
+  return {};
 }
 
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Unknown userId: undefined

[Killed] BlockStatement
auth/src/users/in-memory-user-directory.ts:29:21
 
 export function createLocalUserAccount(
   input: CreateLocalUserInput,
-): LocalUserAccount {
-  assertPasswordPolicy(input.password);
-
-  return {
-    userId: input.userId,
-    tenantId: input.tenantId,
-    email: normalizeEmail(input.email),
-    displayName: input.displayName,
-    roleIds: [...input.roleIds],
-    mfaEnabled: false,
-    accountLocked: false,
-    passwordHash: hashPassword(input.password),
-    accountActive: true,
-    failedAttempts: 0,
-  };
-}
+): LocalUserAccount {}
 
 export class InMemoryUserDirectory {
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'userId')

[Killed] BooleanLiteral
auth/src/users/in-memory-user-directory.ts:38:17
     email: normalizeEmail(input.email),
     displayName: input.displayName,
     roleIds: [...input.roleIds],
-    mfaEnabled: false,
+    mfaEnabled: true,
     accountLocked: false,
     passwordHash: hashPassword(input.password),
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Missing MFA enrollment for userId: usr-apa

[Killed] BooleanLiteral
auth/src/users/in-memory-user-directory.ts:39:20
     displayName: input.displayName,
     roleIds: [...input.roleIds],
     mfaEnabled: false,
-    accountLocked: false,
+    accountLocked: true,
     passwordHash: hashPassword(input.password),
     accountActive: true,
killedBy: InMemoryUserDirectory authenticates emails case-insensitively and trims whitespace
statusReason: expected 'account_locked' to be 'success' // Object.is equality

[Killed] BooleanLiteral
auth/src/users/in-memory-user-directory.ts:41:20
     mfaEnabled: false,
     accountLocked: false,
     passwordHash: hashPassword(input.password),
-    accountActive: true,
+    accountActive: false,
     failedAttempts: 0,
   };
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: expected 'account_inactive' to be 'success' // Object.is equality

[Killed] BlockStatement
auth/src/users/in-memory-user-directory.ts:50:58
   readonly #accountsById = new Map<string, LocalUserAccount>();
   readonly #userIdByEmail = new Map<string, string>();
 
-  constructor(accounts: Iterable<LocalUserAccount> = []) {
-    for (const account of accounts) {
-      this.#insertAccount(account);
-    }
-  }
+  constructor(accounts: Iterable<LocalUserAccount> = []) {}
 
   #insertAccount(account: LocalUserAccount): void {
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: expected 'invalid_credentials' to be 'success' // Object.is equality

[NoCoverage] ArrayDeclaration
auth/src/users/in-memory-user-directory.ts:50:54
   readonly #accountsById = new Map<string, LocalUserAccount>();
   readonly #userIdByEmail = new Map<string, string>();
 
-  constructor(accounts: Iterable<LocalUserAccount> = []) {
+  constructor(accounts: Iterable<LocalUserAccount> = ["Stryker was here"]) {
     for (const account of accounts) {
       this.#insertAccount(account);

[Killed] BlockStatement
auth/src/users/in-memory-user-directory.ts:51:37
   readonly #userIdByEmail = new Map<string, string>();
 
   constructor(accounts: Iterable<LocalUserAccount> = []) {
-    for (const account of accounts) {
-      this.#insertAccount(account);
-    }
+    for (const account of accounts) {}
   }
 
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: expected 'invalid_credentials' to be 'success' // Object.is equality

[Killed] ConditionalExpression
auth/src/users/in-memory-user-directory.ts:57:9
   }
 
   #insertAccount(account: LocalUserAccount): void {
-    if (this.#accountsById.has(account.userId)) {
+    if (true) {
       throw new Error(`Duplicate userId detected: ${account.userId}`);
     }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Duplicate userId detected: usr-office-admin

[NoCoverage] BlockStatement
auth/src/users/in-memory-user-directory.ts:57:49
   }
 
   #insertAccount(account: LocalUserAccount): void {
-    if (this.#accountsById.has(account.userId)) {
-      throw new Error(`Duplicate userId detected: ${account.userId}`);
-    }
+    if (this.#accountsById.has(account.userId)) {}
 
     const normalizedEmail = normalizeEmail(account.email);

[Killed] BlockStatement
auth/src/users/in-memory-user-directory.ts:63:51
 
     const normalizedEmail = normalizeEmail(account.email);
 
-    if (this.#userIdByEmail.has(normalizedEmail)) {
-      throw new Error(`Duplicate email detected: ${normalizedEmail}`);
-    }
+    if (this.#userIdByEmail.has(normalizedEmail)) {}
 
     const storedAccount: LocalUserAccount = {
killedBy: InMemoryUserDirectory rejects duplicate normalized emails
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
auth/src/users/in-memory-user-directory.ts:63:9
 
     const normalizedEmail = normalizeEmail(account.email);
 
-    if (this.#userIdByEmail.has(normalizedEmail)) {
+    if (true) {
       throw new Error(`Duplicate email detected: ${normalizedEmail}`);
     }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Duplicate email detected: office.admin@local.casemind.test

[Killed] StringLiteral
auth/src/users/in-memory-user-directory.ts:64:23
     const normalizedEmail = normalizeEmail(account.email);
 
     if (this.#userIdByEmail.has(normalizedEmail)) {
-      throw new Error(`Duplicate email detected: ${normalizedEmail}`);
+      throw new Error(``);
     }
 
killedBy: InMemoryUserDirectory rejects duplicate normalized emails
statusReason: expected [Function] to throw error matching /duplicate email/i but got ''

[Killed] EqualityOperator
auth/src/users/in-memory-user-directory.ts:71:11
       ...account,
       email: normalizedEmail,
       roleIds: [...account.roleIds],
-      ...(account.mfaEnrollment === undefined
+      ...(account.mfaEnrollment !== undefined
         ? {}
         : {
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'recoveryCodeHashes')

[Killed] ConditionalExpression
auth/src/users/in-memory-user-directory.ts:71:11
       ...account,
       email: normalizedEmail,
       roleIds: [...account.roleIds],
-      ...(account.mfaEnrollment === undefined
+      ...(false
         ? {}
         : {
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'recoveryCodeHashes')

[NoCoverage] ObjectLiteral
auth/src/users/in-memory-user-directory.ts:73:11
       roleIds: [...account.roleIds],
       ...(account.mfaEnrollment === undefined
         ? {}
-        : {
-            mfaEnrollment: {
-              ...account.mfaEnrollment,
-              recoveryCodeHashes: [...account.mfaEnrollment.recoveryCodeHashes],
-            },
-          }),
+        : {}),
     };
 

[Killed] BlockStatement
auth/src/users/in-memory-user-directory.ts:85:53
     this.#userIdByEmail.set(normalizedEmail, account.userId);
   }
 
-  #requireAccount(userId: string): LocalUserAccount {
-    const account = this.#accountsById.get(userId);
-
-    if (account === undefined) {
-      throw new Error(`Unknown userId: ${userId}`);
-    }
-
-    return account;
-  }
+  #requireAccount(userId: string): LocalUserAccount {}
 
   listUsers(): AuthenticatedUser[] {
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'accountActive')

[NoCoverage] BlockStatement
auth/src/users/in-memory-user-directory.ts:95:36
     return account;
   }
 
-  listUsers(): AuthenticatedUser[] {
-    return [...this.#accountsById.values()].map((account) =>
-      toAuthenticatedUser(account),
-    );
-  }
+  listUsers(): AuthenticatedUser[] {}
 
   getAccount(userId: string): LocalUserAccount | undefined {

[NoCoverage] ArrowFunction
auth/src/users/in-memory-user-directory.ts:96:49
   }
 
   listUsers(): AuthenticatedUser[] {
-    return [...this.#accountsById.values()].map((account) =>
-      toAuthenticatedUser(account),
+    return [...this.#accountsById.values()].map(() => undefined,
     );
   }

[Killed] BlockStatement
auth/src/users/in-memory-user-directory.ts:101:60
     );
   }
 
-  getAccount(userId: string): LocalUserAccount | undefined {
-    const account = this.#accountsById.get(userId);
-
-    if (account === undefined) {
-      return undefined;
-    }
-
-    return {
-      ...account,
-      roleIds: [...account.roleIds],
-      ...(account.mfaEnrollment === undefined
-        ? {}
-        : {
-            mfaEnrollment: {
-              ...account.mfaEnrollment,
-              recoveryCodeHashes: [...account.mfaEnrollment.recoveryCodeHashes],
-            },
-          }),
-    };
-  }
+  getAccount(userId: string): LocalUserAccount | undefined {}
 
   createUser(input: CreateLocalUserInput): AuthenticatedUser {
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Unknown userId: usr-apa

[Killed] ObjectLiteral
auth/src/users/in-memory-user-directory.ts:108:12
       return undefined;
     }
 
-    return {
-      ...account,
-      roleIds: [...account.roleIds],
-      ...(account.mfaEnrollment === undefined
-        ? {}
-        : {
-            mfaEnrollment: {
-              ...account.mfaEnrollment,
-              recoveryCodeHashes: [...account.mfaEnrollment.recoveryCodeHashes],
-            },
-          }),
-    };
+    return {};
   }
 
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: No active MFA enrollment for userId: usr-apa

[NoCoverage] BlockStatement
auth/src/users/in-memory-user-directory.ts:122:62
     };
   }
 
-  createUser(input: CreateLocalUserInput): AuthenticatedUser {
-    const account = createLocalUserAccount(input);
-    this.#insertAccount(account);
-    return toAuthenticatedUser(account);
-  }
+  createUser(input: CreateLocalUserInput): AuthenticatedUser {}
 
   authenticatePrimaryFactor(

[Killed] EqualityOperator
auth/src/users/in-memory-user-directory.ts:136:9
     const normalizedEmail = normalizeEmail(email);
     const userId = this.#userIdByEmail.get(normalizedEmail);
 
-    if (userId === undefined) {
+    if (userId !== undefined) {
       return { status: "invalid_credentials" };
     }
killedBy: InMemoryUserDirectory authenticates emails case-insensitively and trims whitespace
statusReason: expected 'invalid_credentials' to be 'success' // Object.is equality

[Killed] ConditionalExpression
auth/src/users/in-memory-user-directory.ts:136:9
     const normalizedEmail = normalizeEmail(email);
     const userId = this.#userIdByEmail.get(normalizedEmail);
 
-    if (userId === undefined) {
+    if (true) {
       return { status: "invalid_credentials" };
     }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: expected 'invalid_credentials' to be 'success' // Object.is equality

[Killed] BooleanLiteral
auth/src/users/in-memory-user-directory.ts:142:9
 
     const account = this.#requireAccount(userId);
 
-    if (!account.accountActive) {
+    if (account.accountActive) {
       return { status: "account_inactive" };
     }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: expected 'account_inactive' to be 'success' // Object.is equality

[Killed] ConditionalExpression
auth/src/users/in-memory-user-directory.ts:142:9
 
     const account = this.#requireAccount(userId);
 
-    if (!account.accountActive) {
+    if (true) {
       return { status: "account_inactive" };
     }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: expected 'account_inactive' to be 'success' // Object.is equality

[Killed] ConditionalExpression
auth/src/users/in-memory-user-directory.ts:146:9
       return { status: "account_inactive" };
     }
 
-    if (account.accountLocked) {
+    if (true) {
       return { status: "account_locked" };
     }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: expected 'account_locked' to be 'success' // Object.is equality

[Survived] ConditionalExpression
auth/src/users/in-memory-user-directory.ts:146:9
       return { status: "account_inactive" };
     }
 
-    if (account.accountLocked) {
+    if (false) {
       return { status: "account_locked" };
     }

[NoCoverage] StringLiteral
auth/src/users/in-memory-user-directory.ts:147:24
     }
 
     if (account.accountLocked) {
-      return { status: "account_locked" };
+      return { status: "" };
     }
 

[Killed] ConditionalExpression
auth/src/users/in-memory-user-directory.ts:150:9
       return { status: "account_locked" };
     }
 
-    if (!verifyPassword(password, account.passwordHash)) {
+    if (false) {
       account.failedAttempts += 1;
 
killedBy: AuthService locks a user after five failed attempts and allows an admin reset
statusReason: expected 'success' to be 'invalid_credentials' // Object.is equality

[Killed] ConditionalExpression
auth/src/users/in-memory-user-directory.ts:150:9
       return { status: "account_locked" };
     }
 
-    if (!verifyPassword(password, account.passwordHash)) {
+    if (true) {
       account.failedAttempts += 1;
 
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: expected 'invalid_credentials' to be 'success' // Object.is equality

[Killed] AssignmentOperator
auth/src/users/in-memory-user-directory.ts:151:7
     }
 
     if (!verifyPassword(password, account.passwordHash)) {
-      account.failedAttempts += 1;
+      account.failedAttempts -= 1;
 
       if (account.failedAttempts >= maxFailedAttempts) {
killedBy: AuthService locks a user after five failed attempts and allows an admin reset
statusReason: expected 'invalid_credentials' to be 'account_locked' // Object.is equality

[Killed] EqualityOperator
auth/src/users/in-memory-user-directory.ts:153:11
     if (!verifyPassword(password, account.passwordHash)) {
       account.failedAttempts += 1;
 
-      if (account.failedAttempts >= maxFailedAttempts) {
+      if (account.failedAttempts < maxFailedAttempts) {
         account.accountLocked = true;
         return { status: "account_locked" };
killedBy: AuthService locks a user after five failed attempts and allows an admin reset
statusReason: expected 'account_locked' to be 'invalid_credentials' // Object.is equality

[Killed] BlockStatement
auth/src/users/in-memory-user-directory.ts:153:56
     if (!verifyPassword(password, account.passwordHash)) {
       account.failedAttempts += 1;
 
-      if (account.failedAttempts >= maxFailedAttempts) {
-        account.accountLocked = true;
-        return { status: "account_locked" };
-      }
+      if (account.failedAttempts >= maxFailedAttempts) {}
 
       return { status: "invalid_credentials" };
killedBy: AuthService locks a user after five failed attempts and allows an admin reset
statusReason: expected 'invalid_credentials' to be 'account_locked' // Object.is equality

[Survived] BooleanLiteral
auth/src/users/in-memory-user-directory.ts:154:33
       account.failedAttempts += 1;
 
       if (account.failedAttempts >= maxFailedAttempts) {
-        account.accountLocked = true;
+        account.accountLocked = false;
         return { status: "account_locked" };
       }

[Killed] BooleanLiteral
auth/src/users/in-memory-user-directory.ts:162:29
     }
 
     account.failedAttempts = 0;
-    account.accountLocked = false;
+    account.accountLocked = true;
 
     return {
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: expected 'account_locked' to be 'success' // Object.is equality

[Killed] ObjectLiteral
auth/src/users/in-memory-user-directory.ts:164:12
     account.failedAttempts = 0;
     account.accountLocked = false;
 
-    return {
-      status: "success",
-      user: toAuthenticatedUser(account),
-    };
+    return {};
   }
 
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: expected undefined to be 'success' // Object.is equality

[Killed] BlockStatement
auth/src/users/in-memory-user-directory.ts:170:70
     };
   }
 
-  setMfaEnrollment(userId: string, state: TotpEnrollmentState): void {
-    const account = this.#requireAccount(userId);
-
-    account.mfaEnrollment = {
-      ...state,
-      recoveryCodeHashes: [...state.recoveryCodeHashes],
-    };
-    account.mfaEnabled = state.verifiedAt !== undefined;
-  }
+  setMfaEnrollment(userId: string, state: TotpEnrollmentState): void {}
 
   resetMfa(userId: string): void {
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: No active MFA enrollment for userId: usr-apa

[Killed] ConditionalExpression
auth/src/users/in-memory-user-directory.ts:177:26
       ...state,
       recoveryCodeHashes: [...state.recoveryCodeHashes],
     };
-    account.mfaEnabled = state.verifiedAt !== undefined;
+    account.mfaEnabled = false;
   }
 
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: expected 'success' to be 'mfa_required' // Object.is equality

[Killed] EqualityOperator
auth/src/users/in-memory-user-directory.ts:177:26
       ...state,
       recoveryCodeHashes: [...state.recoveryCodeHashes],
     };
-    account.mfaEnabled = state.verifiedAt !== undefined;
+    account.mfaEnabled = state.verifiedAt === undefined;
   }
 
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: expected 'success' to be 'mfa_required' // Object.is equality

[NoCoverage] BlockStatement
auth/src/users/in-memory-user-directory.ts:180:34
     account.mfaEnabled = state.verifiedAt !== undefined;
   }
 
-  resetMfa(userId: string): void {
-    const account = this.#requireAccount(userId);
-
-    delete account.mfaEnrollment;
-    account.mfaEnabled = false;
-  }
+  resetMfa(userId: string): void {}
 
   resetLockout(userId: string): void {

[NoCoverage] BooleanLiteral
auth/src/users/in-memory-user-directory.ts:184:26
     const account = this.#requireAccount(userId);
 
     delete account.mfaEnrollment;
-    account.mfaEnabled = false;
+    account.mfaEnabled = true;
   }
 

[Killed] BlockStatement
auth/src/users/in-memory-user-directory.ts:187:38
     account.mfaEnabled = false;
   }
 
-  resetLockout(userId: string): void {
-    const account = this.#requireAccount(userId);
-
-    account.failedAttempts = 0;
-    account.accountLocked = false;
-  }
+  resetLockout(userId: string): void {}
 
   deactivateUser(userId: string): void {
killedBy: AuthService locks a user after five failed attempts and allows an admin reset
statusReason: expected 'account_locked' to be 'success' // Object.is equality

[NoCoverage] BlockStatement
auth/src/users/in-memory-user-directory.ts:194:40
     account.accountLocked = false;
   }
 
-  deactivateUser(userId: string): void {
-    const account = this.#requireAccount(userId);
-
-    account.accountActive = false;
-    account.accountLocked = true;
-  }
+  deactivateUser(userId: string): void {}
 
   updatePassword(userId: string, nextPassword: string): void {

[NoCoverage] BooleanLiteral
auth/src/users/in-memory-user-directory.ts:197:29
   deactivateUser(userId: string): void {
     const account = this.#requireAccount(userId);
 
-    account.accountActive = false;
+    account.accountActive = true;
     account.accountLocked = true;
   }

[NoCoverage] BooleanLiteral
auth/src/users/in-memory-user-directory.ts:198:29
     const account = this.#requireAccount(userId);
 
     account.accountActive = false;
-    account.accountLocked = true;
+    account.accountLocked = false;
   }
 

[Killed] BlockStatement
auth/src/users/in-memory-user-directory.ts:201:62
     account.accountLocked = true;
   }
 
-  updatePassword(userId: string, nextPassword: string): void {
-    const account = this.#requireAccount(userId);
-
-    assertPasswordPolicy(nextPassword);
-
-    account.passwordHash = hashPassword(nextPassword);
-    account.failedAttempts = 0;
-    account.accountLocked = false;
-  }
+  updatePassword(userId: string, nextPassword: string): void {}
 }
 
killedBy: AuthService rejects weak password updates
statusReason: promise resolved "undefined" instead of rejecting
