[Killed] BlockStatement
auth/src/mfa/recovery-codes.ts:7:61
 const RECOVERY_SEGMENT_LENGTH = 4;
 const RECOVERY_SEGMENTS = 4;
 
-export function normalizeRecoveryCode(code: string): string {
-  return code.replaceAll("-", "").trim().toUpperCase();
-}
+export function normalizeRecoveryCode(code: string): string {}
 
 export function hashRecoveryCode(code: string): string {
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Survived] MethodExpression
auth/src/mfa/recovery-codes.ts:8:10
 const RECOVERY_SEGMENTS = 4;
 
 export function normalizeRecoveryCode(code: string): string {
-  return code.replaceAll("-", "").trim().toUpperCase();
+  return code.replaceAll("-", "").toUpperCase();
 }
 

[Survived] MethodExpression
auth/src/mfa/recovery-codes.ts:8:10
 const RECOVERY_SEGMENTS = 4;
 
 export function normalizeRecoveryCode(code: string): string {
-  return code.replaceAll("-", "").trim().toUpperCase();
+  return code.replaceAll("-", "").trim().toLowerCase();
 }
 

[Survived] BlockStatement
auth/src/mfa/recovery-codes.ts:11:56
   return code.replaceAll("-", "").trim().toUpperCase();
 }
 
-export function hashRecoveryCode(code: string): string {
-  return createHash("sha256")
-    .update(normalizeRecoveryCode(code), "utf8")
-    .digest("hex");
-}
+export function hashRecoveryCode(code: string): string {}
 
 function generateRecoveryCode(): string {

[Killed] StringLiteral
auth/src/mfa/recovery-codes.ts:12:21
 }
 
 export function hashRecoveryCode(code: string): string {
-  return createHash("sha256")
+  return createHash("")
     .update(normalizeRecoveryCode(code), "utf8")
     .digest("hex");
killedBy: recovery codes normalizes formatting when verifying a code hash
statusReason: Digest method not supported

[Survived] StringLiteral
auth/src/mfa/recovery-codes.ts:13:42
 
 export function hashRecoveryCode(code: string): string {
   return createHash("sha256")
-    .update(normalizeRecoveryCode(code), "utf8")
+    .update(normalizeRecoveryCode(code), "")
     .digest("hex");
 }

[Timeout] BlockStatement
auth/src/mfa/recovery-codes.ts:17:41
     .digest("hex");
 }
 
-function generateRecoveryCode(): string {
-  const characters = Array.from(
-    { length: RECOVERY_SEGMENT_LENGTH * RECOVERY_SEGMENTS },
-    () => RECOVERY_ALPHABET[randomInt(RECOVERY_ALPHABET.length)],
-  );
-  const segments: string[] = [];
-
-  for (
-    let index = 0;
-    index < characters.length;
-    index += RECOVERY_SEGMENT_LENGTH
-  ) {
-    segments.push(
-      characters.slice(index, index + RECOVERY_SEGMENT_LENGTH).join(""),
-    );
-  }
-
-  return segments.join("-");
-}
+function generateRecoveryCode(): string {}
 
 export function generateRecoveryCodes(count: number = 10): string[] {

[Survived] ArithmeticOperator
auth/src/mfa/recovery-codes.ts:19:15
 
 function generateRecoveryCode(): string {
   const characters = Array.from(
-    { length: RECOVERY_SEGMENT_LENGTH * RECOVERY_SEGMENTS },
+    { length: RECOVERY_SEGMENT_LENGTH / RECOVERY_SEGMENTS },
     () => RECOVERY_ALPHABET[randomInt(RECOVERY_ALPHABET.length)],
   );

[Timeout] ArrowFunction
auth/src/mfa/recovery-codes.ts:20:5
 function generateRecoveryCode(): string {
   const characters = Array.from(
     { length: RECOVERY_SEGMENT_LENGTH * RECOVERY_SEGMENTS },
-    () => RECOVERY_ALPHABET[randomInt(RECOVERY_ALPHABET.length)],
+    () => undefined,
   );
   const segments: string[] = [];

[Survived] ArrayDeclaration
auth/src/mfa/recovery-codes.ts:22:30
     { length: RECOVERY_SEGMENT_LENGTH * RECOVERY_SEGMENTS },
     () => RECOVERY_ALPHABET[randomInt(RECOVERY_ALPHABET.length)],
   );
-  const segments: string[] = [];
+  const segments: string[] = ["Stryker was here"];
 
   for (

[Timeout] EqualityOperator
auth/src/mfa/recovery-codes.ts:26:5
 
   for (
     let index = 0;
-    index < characters.length;
+    index >= characters.length;
     index += RECOVERY_SEGMENT_LENGTH
   ) {

[Survived] EqualityOperator
auth/src/mfa/recovery-codes.ts:26:5
 
   for (
     let index = 0;
-    index < characters.length;
+    index <= characters.length;
     index += RECOVERY_SEGMENT_LENGTH
   ) {

[Timeout] AssignmentOperator
auth/src/mfa/recovery-codes.ts:27:5
   for (
     let index = 0;
     index < characters.length;
-    index += RECOVERY_SEGMENT_LENGTH
+    index -= RECOVERY_SEGMENT_LENGTH
   ) {
     segments.push(

[Timeout] BlockStatement
auth/src/mfa/recovery-codes.ts:28:5
     let index = 0;
     index < characters.length;
     index += RECOVERY_SEGMENT_LENGTH
-  ) {
-    segments.push(
-      characters.slice(index, index + RECOVERY_SEGMENT_LENGTH).join(""),
-    );
-  }
+  ) {}
 
   return segments.join("-");

[Survived] MethodExpression
auth/src/mfa/recovery-codes.ts:30:7
     index += RECOVERY_SEGMENT_LENGTH
   ) {
     segments.push(
-      characters.slice(index, index + RECOVERY_SEGMENT_LENGTH).join(""),
+      characters.join(""),
     );
   }

[Survived] ArithmeticOperator
auth/src/mfa/recovery-codes.ts:30:31
     index += RECOVERY_SEGMENT_LENGTH
   ) {
     segments.push(
-      characters.slice(index, index + RECOVERY_SEGMENT_LENGTH).join(""),
+      characters.slice(index, index - RECOVERY_SEGMENT_LENGTH).join(""),
     );
   }

[Killed] BlockStatement
auth/src/mfa/recovery-codes.ts:37:69
   return segments.join("-");
 }
 
-export function generateRecoveryCodes(count: number = 10): string[] {
-  const codes = new Set<string>();
-
-  while (codes.size < count) {
-    codes.add(generateRecoveryCode());
-  }
-
-  return [...codes];
-}
+export function generateRecoveryCodes(count: number = 10): string[] {}
 
 export function verifyRecoveryCodeHash(
killedBy: AuthService requires MFA after enrollment and accepts a valid TOTP code
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
auth/src/mfa/recovery-codes.ts:40:10
 export function generateRecoveryCodes(count: number = 10): string[] {
   const codes = new Set<string>();
 
-  while (codes.size < count) {
+  while (false) {
     codes.add(generateRecoveryCode());
   }
killedBy: TOTP enrollment activates MFA and issues recovery codes
statusReason: expected [] to have a length of 10 but got +0

[Killed] EqualityOperator
auth/src/mfa/recovery-codes.ts:40:10
 export function generateRecoveryCodes(count: number = 10): string[] {
   const codes = new Set<string>();
 
-  while (codes.size < count) {
+  while (codes.size >= count) {
     codes.add(generateRecoveryCode());
   }
killedBy: recovery codes generates unique codes for varying batch sizes
statusReason: Property failed after 1 tests
{ seed: -1130194288, path: "0:0", endOnFailure: true }
Counterexample: [1]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
auth/src/mfa/recovery-codes.ts:50:12
 export function verifyRecoveryCodeHash(
   code: string,
   expectedHash: string,
-): boolean {
-  return hashRecoveryCode(code) === expectedHash;
-}
+): boolean {}
 
killedBy: recovery codes normalizes formatting when verifying a code hash
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
auth/src/mfa/recovery-codes.ts:51:10
   code: string,
   expectedHash: string,
 ): boolean {
-  return hashRecoveryCode(code) === expectedHash;
+  return false;
 }
 
killedBy: recovery codes normalizes formatting when verifying a code hash
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
auth/src/mfa/recovery-codes.ts:51:10
   code: string,
   expectedHash: string,
 ): boolean {
-  return hashRecoveryCode(code) === expectedHash;
+  return hashRecoveryCode(code) !== expectedHash;
 }
 
killedBy: recovery codes normalizes formatting when verifying a code hash
statusReason: expected false to be true // Object.is equality
