[Killed] BlockStatement
auth/src/policy/session-policy.ts:10:56
   secureCookies: false,
 };
 
-function addMinutes(date: Date, minutes: number): Date {
-  return new Date(date.getTime() + minutes * 60_000);
-}
+function addMinutes(date: Date, minutes: number): Date {}
 
 function addHours(date: Date, hours: number): Date {
killedBy: session policy caps idle expiration at the absolute expiration
statusReason: Cannot read properties of undefined (reading 'getTime')

[Killed] ArithmeticOperator
auth/src/policy/session-policy.ts:11:19
 };
 
 function addMinutes(date: Date, minutes: number): Date {
-  return new Date(date.getTime() + minutes * 60_000);
+  return new Date(date.getTime() - minutes * 60_000);
 }
 
killedBy: session policy caps idle expiration at the absolute expiration
statusReason: expected '2026-03-10T23:25:00.000Z' to be '2026-03-11T00:00:00.000Z' // Object.is equality

[Killed] ArithmeticOperator
auth/src/policy/session-policy.ts:11:36
 };
 
 function addMinutes(date: Date, minutes: number): Date {
-  return new Date(date.getTime() + minutes * 60_000);
+  return new Date(date.getTime() + minutes / 60_000);
 }
 
killedBy: session policy caps idle expiration at the absolute expiration
statusReason: expected '2026-03-10T23:55:00.000Z' to be '2026-03-11T00:00:00.000Z' // Object.is equality

[Killed] BlockStatement
auth/src/policy/session-policy.ts:14:52
   return new Date(date.getTime() + minutes * 60_000);
 }
 
-function addHours(date: Date, hours: number): Date {
-  return new Date(date.getTime() + hours * 3_600_000);
-}
+function addHours(date: Date, hours: number): Date {}
 
 export function computeAbsoluteExpiration(
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'getTime')

[Killed] ArithmeticOperator
auth/src/policy/session-policy.ts:15:36
 }
 
 function addHours(date: Date, hours: number): Date {
-  return new Date(date.getTime() + hours * 3_600_000);
+  return new Date(date.getTime() + hours / 3_600_000);
 }
 
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: Cannot persist an expired session.

[Killed] ArithmeticOperator
auth/src/policy/session-policy.ts:15:19
 }
 
 function addHours(date: Date, hours: number): Date {
-  return new Date(date.getTime() + hours * 3_600_000);
+  return new Date(date.getTime() - hours * 3_600_000);
 }
 
killedBy: RedisSessionStore persists, refreshes, and invalidates sessions in Redis
statusReason: Cannot persist an expired session.

[Killed] BlockStatement
auth/src/policy/session-policy.ts:21:9
 export function computeAbsoluteExpiration(
   issuedAt: Date,
   policy: SessionPolicy,
-): Date {
-  return addHours(issuedAt, policy.absoluteTimeoutHours);
-}
+): Date {}
 
 export function computeIdleExpiration(
killedBy: session policy caps idle expiration at the absolute expiration
statusReason: Cannot read properties of undefined (reading 'getTime')

[Killed] BlockStatement
auth/src/policy/session-policy.ts:29:9
   lastActivityAt: Date,
   policy: SessionPolicy,
   absoluteExpiresAt: Date,
-): Date {
-  const idleExpiration = addMinutes(
-    lastActivityAt,
-    policy.inactivityTimeoutMinutes,
-  );
-
-  return idleExpiration.getTime() <= absoluteExpiresAt.getTime()
-    ? idleExpiration
-    : absoluteExpiresAt;
-}
+): Date {}
 
 export function isSessionExpired(
killedBy: session policy caps idle expiration at the absolute expiration
statusReason: Cannot read properties of undefined (reading 'toISOString')

[Killed] EqualityOperator
auth/src/policy/session-policy.ts:35:10
     policy.inactivityTimeoutMinutes,
   );
 
-  return idleExpiration.getTime() <= absoluteExpiresAt.getTime()
+  return idleExpiration.getTime() > absoluteExpiresAt.getTime()
     ? idleExpiration
     : absoluteExpiresAt;
killedBy: session policy caps idle expiration at the absolute expiration
statusReason: expected '2026-03-11T00:25:00.000Z' to be '2026-03-11T00:00:00.000Z' // Object.is equality

[Killed] ConditionalExpression
auth/src/policy/session-policy.ts:35:10
     policy.inactivityTimeoutMinutes,
   );
 
-  return idleExpiration.getTime() <= absoluteExpiresAt.getTime()
+  return true
     ? idleExpiration
     : absoluteExpiresAt;
killedBy: session policy caps idle expiration at the absolute expiration
statusReason: expected '2026-03-11T00:25:00.000Z' to be '2026-03-11T00:00:00.000Z' // Object.is equality

[Killed] BlockStatement
auth/src/policy/session-policy.ts:43:12
 export function isSessionExpired(
   session: Pick<AuthSession, "idleExpiresAt" | "absoluteExpiresAt">,
   now: Date = new Date(),
-): boolean {
-  const idleExpiration = new Date(session.idleExpiresAt);
-  const absoluteExpiration = new Date(session.absoluteExpiresAt);
-  const effectiveExpiration = Math.min(
-    idleExpiration.getTime(),
-    absoluteExpiration.getTime(),
-  );
-
-  return now.getTime() >= effectiveExpiration;
-}
+): boolean {}
 
killedBy: session policy expires a session once the idle window is exceeded
statusReason: expected undefined to be true // Object.is equality

[Killed] MethodExpression
auth/src/policy/session-policy.ts:46:31
 ): boolean {
   const idleExpiration = new Date(session.idleExpiresAt);
   const absoluteExpiration = new Date(session.absoluteExpiresAt);
-  const effectiveExpiration = Math.min(
-    idleExpiration.getTime(),
-    absoluteExpiration.getTime(),
-  );
+  const effectiveExpiration = Math.max(idleExpiration.getTime(), absoluteExpiration.getTime());
 
   return now.getTime() >= effectiveExpiration;
killedBy: session policy expires a session once the idle window is exceeded
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
auth/src/policy/session-policy.ts:51:10
     absoluteExpiration.getTime(),
   );
 
-  return now.getTime() >= effectiveExpiration;
+  return now.getTime() < effectiveExpiration;
 }
 
killedBy: session policy expires a session once the idle window is exceeded
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
auth/src/policy/session-policy.ts:51:10
     absoluteExpiration.getTime(),
   );
 
-  return now.getTime() >= effectiveExpiration;
+  return now.getTime() > effectiveExpiration;
 }
 
killedBy: session policy expires a session once the idle window is exceeded
statusReason: expected false to be true // Object.is equality
