[Killed] BlockStatement
auth/src/users/synthetic-users.ts:60:23
 
 export function createSyntheticLocalAccounts(
   config?: Pick<LocalAuthConfig, "syntheticPassword" | "syntheticTenantId">,
-): LocalUserAccount[] {
-  const syntheticPassword =
-    config?.syntheticPassword ?? DEFAULT_SYNTHETIC_PASSWORD;
-  const syntheticTenantId =
-    config?.syntheticTenantId ?? DEFAULT_SYNTHETIC_TENANT_ID;
-
-  return DEFAULT_SYNTHETIC_USER_BLUEPRINTS.map((blueprint) =>
-    createLocalUserAccount({
-      ...blueprint,
-      tenantId: syntheticTenantId,
-      password: syntheticPassword,
-    }),
-  );
-}
+): LocalUserAccount[] {}
 
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: expected 'invalid_credentials' to be 'success' // Object.is equality

[Killed] LogicalOperator
auth/src/users/synthetic-users.ts:62:5
   config?: Pick<LocalAuthConfig, "syntheticPassword" | "syntheticTenantId">,
 ): LocalUserAccount[] {
   const syntheticPassword =
-    config?.syntheticPassword ?? DEFAULT_SYNTHETIC_PASSWORD;
+    config?.syntheticPassword && DEFAULT_SYNTHETIC_PASSWORD;
   const syntheticTenantId =
     config?.syntheticTenantId ?? DEFAULT_SYNTHETIC_TENANT_ID;
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] OptionalChaining
auth/src/users/synthetic-users.ts:62:5
   config?: Pick<LocalAuthConfig, "syntheticPassword" | "syntheticTenantId">,
 ): LocalUserAccount[] {
   const syntheticPassword =
-    config?.syntheticPassword ?? DEFAULT_SYNTHETIC_PASSWORD;
+    config.syntheticPassword ?? DEFAULT_SYNTHETIC_PASSWORD;
   const syntheticTenantId =
     config?.syntheticTenantId ?? DEFAULT_SYNTHETIC_TENANT_ID;
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'syntheticPassword')

[Killed] LogicalOperator
auth/src/users/synthetic-users.ts:64:5
   const syntheticPassword =
     config?.syntheticPassword ?? DEFAULT_SYNTHETIC_PASSWORD;
   const syntheticTenantId =
-    config?.syntheticTenantId ?? DEFAULT_SYNTHETIC_TENANT_ID;
+    config?.syntheticTenantId && DEFAULT_SYNTHETIC_TENANT_ID;
 
   return DEFAULT_SYNTHETIC_USER_BLUEPRINTS.map((blueprint) =>
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: expected undefined to be 'tenant-local-demo' // Object.is equality

[Killed] OptionalChaining
auth/src/users/synthetic-users.ts:64:5
   const syntheticPassword =
     config?.syntheticPassword ?? DEFAULT_SYNTHETIC_PASSWORD;
   const syntheticTenantId =
-    config?.syntheticTenantId ?? DEFAULT_SYNTHETIC_TENANT_ID;
+    config.syntheticTenantId ?? DEFAULT_SYNTHETIC_TENANT_ID;
 
   return DEFAULT_SYNTHETIC_USER_BLUEPRINTS.map((blueprint) =>
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'syntheticTenantId')

[Killed] ArrowFunction
auth/src/users/synthetic-users.ts:66:48
   const syntheticTenantId =
     config?.syntheticTenantId ?? DEFAULT_SYNTHETIC_TENANT_ID;
 
-  return DEFAULT_SYNTHETIC_USER_BLUEPRINTS.map((blueprint) =>
-    createLocalUserAccount({
-      ...blueprint,
-      tenantId: syntheticTenantId,
-      password: syntheticPassword,
-    }),
+  return DEFAULT_SYNTHETIC_USER_BLUEPRINTS.map(() => undefined,
   );
 }
killedBy: AuthService creates a local session for a seeded synthetic user
statusReason: Cannot read properties of undefined (reading 'userId')
