[Killed] BlockStatement
auth/src/providers/credentials.ts:10:34
 
 export function createCredentialsProvider(
   authService: AuthService,
-): CredentialsProviderDefinition {
-  return {
-    id: "credentials",
-    type: "credentials",
-    authorize(input: LoginInput): Promise<LoginResult> {
-      return authService.login(input);
-    },
-  };
-}
+): CredentialsProviderDefinition {}
 
killedBy: credentials provider delegates authorization to the auth service
statusReason: Cannot read properties of undefined (reading 'authorize')

[Survived] StringLiteral
auth/src/providers/credentials.ts:12:9
   authService: AuthService,
 ): CredentialsProviderDefinition {
   return {
-    id: "credentials",
+    id: "",
     type: "credentials",
     authorize(input: LoginInput): Promise<LoginResult> {

[Killed] BlockStatement
auth/src/providers/credentials.ts:14:56
   return {
     id: "credentials",
     type: "credentials",
-    authorize(input: LoginInput): Promise<LoginResult> {
-      return authService.login(input);
-    },
+    authorize(input: LoginInput): Promise<LoginResult> {},
   };
 }
killedBy: credentials provider delegates authorization to the auth service
statusReason: expected "spy" to be called once, but got 0 times
